{
	"tabs": {
		"general": "Általános",
		"behaviour": "Viselkedés",
		"network": "Hálózat",
		"appearance": "Megjelenés",
		"integration": "Integráció"
	},
	"general": {
		"appname": {
			"label": "Alkalmazás neve",
			"description": "Az alkalmazás műszerfalon való megjelenítéséhez."
		},
		"internalAddress": {
			"label": "Belső cím",
			"description": "Az alkalmazás belső IP-címe.",
			"troubleshoot": {
				"label": "Hibát talált?",
				"header": "Íme egy lista a gyakran előforduló hibákról és a hibaelhárításról:",
				"lines": {
					"nothingAfterPort": "A legtöbb, ha nem minden esetben nem szabad a port után semmilyen útvonalat beírni. (Még a '/admin' a pihole vagy a '/web' a plex esetében sem)",
					"protocolCheck": "Mindig győződjön meg arról, hogy az URL-cím előtt http vagy https szerepel, és győződjön meg arról, hogy a megfelelőt használja.",
					"preferIP": "Ajánlott a kommunikálni kívánt gép vagy konténer közvetlen ip címét használni.",
					"enablePings": "Ellenőrizze, hogy az IP helyes-e a pingelés engedélyezésével. Testreszabás -> Elrendezés -> Pingek engedélyezése. Egy kis piros vagy zöld buborék fog megjelenni az alkalmazás csempéin, és ha lebegteted, akkor a válaszkódot fogod látni (a legtöbb esetben egy zöld buborék 200-as kóddal várható).",
					"wget": "Hogy megbizonyosodjunk arról, hogy a homarr tud kommunikálni a többi alkalmazással, győződjünk meg róla, hogy a wget/curl/ping parancsokat az alkalmazás IP:portjára adja ki.",
					"iframe": "Az iframe-ek esetében mindig ugyanazt a protokollt (http/s) kell használni, mint a Homarr.",
					"clearCache": "Egyes információk a gyorsítótárban vannak regisztrálva, ezért előfordulhat, hogy az integráció nem működik, hacsak nem törli a gyorsítótárat a Homarr általános beállításaiban."
				},
				"footer": "További hibaelhárításért forduljon hozzánk a {{discord}} címen."
			}
		},
		"externalAddress": {
			"label": "Külső cím",
			"description": "URL, amely az alkalmazásra kattintva megnyílik.",
			"tooltip": "A dinamikus címek létrehozásához néhány változót használhat:<br><br><b>[homarr_base]</b>: teljes cím a port és az elérési út nélkül. <i>(Példa: 'https://subdomain.homarr.dev')</i><br><b>[homarr_hostname]</b>: teljes alap url, beleértve az aktuális aldomain-t is. <i>(Példa: 'subdomain.homarr.dev')</i><br><b>[homarr_domain]</b>: domain az aldomainek kiszűrésével. <i>(Példa: `homarr.dev')</i><br><b>[homarr_protocol]</b>: <i>http/https</i><br><br>Ezek a változók mind az aktuális url-től függnek."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Megnyitás új lapon",
			"description": "Az alkalmazás megnyitása új lapon az aktuális lap helyett."
		},
		"tooltipDescription": {
			"label": "Alkalmazás leírása",
			"description": "A beírt szöveg akkor jelenik meg, amikor az alkalmazás fölé mozgatja a gépet.\nHasználja ezt, hogy a felhasználóknak további részleteket adjon az alkalmazásáról, vagy hagyja üresen, hogy ne legyen semmi."
		},
		"customProtocolWarning": "Nem szabványos protokoll használata. Ez előre telepített alkalmazásokat igényelhet, és biztonsági kockázatot jelenthet. Győződjön meg arról, hogy a címe biztonságos és megbízható."
	},
	"network": {
		"statusChecker": {
			"label": "Állapotellenőrző",
			"description": "Egy egyszerű HTTP(S) kéréssel ellenőrzi, hogy az alkalmazás online van-e."
		},
		"statusCodes": {
			"label": "HTTP állapotkódok",
			"description": "Az online állapotúnak tekintett HTTP státuszkódok."
		}
	},
	"appearance": {
		"icon": {
			"label": "Alkalmazás ikon",
			"description": "Kezdjen el gépelni egy ikon kereséséhez. Egy egyéni ikon használatához beilleszthet egy kép URL-címét is.",
			"autocomplete": {
				"title": "Nincs eredmény",
				"text": "Próbáljon meg konkrétabb keresőkifejezést használni. Ha nem találja a kívánt ikont, illessze be a fenti kép URL-címét egy egyéni ikonhoz"
			},
			"noItems": {
				"title": "Külső ikonok betöltése",
				"text": "Ez néhány másodpercet vehet igénybe"
			}
		},
		"appNameFontSize": {
			"label": "Alkalmazásnév Betűméret",
			"description": "Beállítja a betűméretet, amikor az alkalmazás neve megjelenik a csempén."
		},
		"appNameStatus": {
			"label": "Alkalmazás neve Állapot",
			"description": "Válassza ki, hogy hol jelenjen meg a cím, ha egyáltalán megjelenjen.",
			"dropdown": {
				"normal": "Csak a cím megjelenítése a csempén",
				"hover": "A cím megjelenítése csak a tooltip megjelenítésekor",
				"hidden": "Egyáltalán ne mutasd meg"
			}
		},
		"positionAppName": {
			"label": "Alkalmazás neve Pozíció",
			"description": "Az alkalmazás nevének pozíciója az ikonhoz képest.",
			"dropdown": {
				"top": "Felül",
				"right": "Jobb",
				"bottom": "Alul",
				"left": "Bal"
			}
		},
		"lineClampAppName": {
			"label": "Alkalmazásnév Vonalrögzítő",
			"description": "Meghatározza, hogy a cím hány sorban férjen el maximálisan. A 0 érték korlátlan."
		}
	},
	"integration": {
		"type": {
			"label": "Integrációs konfiguráció",
			"description": "Az integrációs konfiguráció, amelyet az alkalmazáshoz való csatlakozáshoz használnak.",
			"placeholder": "Válasszon ki egy integrációt",
			"defined": "Beállítva",
			"undefined": "Nincs beállítva",
			"public": "Nyilvános",
			"private": "Nem nyilvános",
			"explanationPrivate": "A privát titok csak egyszer kerül elküldésre a kiszolgálónak. Miután a böngésző frissítette az oldalt, a titkot soha többé nem küldi el.",
			"explanationPublic": "A nem privát titok mindig elküldésre kerül az ügyfélnek, és az API-n keresztül elérhető. Nem tartalmazhat bizalmas értékeket, például felhasználóneveket, jelszavakat, tokeneket, tanúsítványokat és hasonlókat!"
		},
		"secrets": {
			"description": "A titok frissítéséhez adja meg az értéket, és kattintson a mentés gombra. A titok törléséhez használja a törlés gombot.",
			"warning": "A hitelesítő adatok az integrációkhoz való hozzáférésként szolgálnak, és soha ne ossza meg őket senki mással a <strong></strong> címen. A Homarr csapata soha nem fogja kérni a hitelesítő adatokat. Győződjön meg róla, hogy <strong>biztonságosan tárolja és kezeli titkait</strong>.",
			"clear": "Titok törlése",
			"save": "Titok mentése",
			"update": "Titok frissítése"
		}
	},
	"validation": {
		"popover": "Az űrlapja érvénytelen adatokat tartalmaz, ezért nem lehet elmenteni. Kérjük, oldja meg az összes problémát, és kattintson újra erre a gombra a módosítások mentéséhez",
		"name": "Név szükséges",
		"noUrl": "Url szükséges",
		"invalidUrl": "Az érték nem érvényes url",
		"noIconUrl": "Ez a mező kötelező",
		"noExternalUri": "Külső URI szükséges",
		"invalidExternalUri": "A külső URI nem érvényes uri"
	}
}
