{
	"tabs": {
		"general": "Algemeen",
		"behaviour": "Gedrag",
		"network": "Netwerk",
		"appearance": "Opmaak",
		"integration": "Integratie"
	},
	"general": {
		"appname": {
			"label": "App naam",
			"description": "Gebruikt voor de weergave van de app op het dashboard"
		},
		"internalAddress": {
			"label": "Intern adres",
			"description": "Intern IP-adres van de app"
		},
		"externalAddress": {
			"label": "Extern adres",
			"description": "URL die wordt geopend in de browser wanneer op de app wordt geklikt"
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Open in nieuw tabblad",
			"description": "Open de link in een nieuw tabblad"
		}
	},
	"network": {
		"statusChecker": {
			"label": "Status checker",
			"description": "Stuurt een eenvoudig HTTP / HTTPS-verzoek om te controleren of uw app online is"
		},
		"statusCodes": {
			"label": "HTTP-statuscodes",
			"description": "Bepaalt welke responscodes zijn toegestaan voor deze app om \"Online\" te zijn"
		}
	},
	"appearance": {
		"icon": {
			"label": "App icoon",
			"description": "Logo van uw app weergegeven in uw dashboard. (Moet een inhoud met een afbeelding terugsturen)"
		}
	},
	"integration": {
		"type": {
			"label": "Integratie configuratie",
			"description": "Behandelt deze app als de geselecteerde integratie en biedt u configuratie per app",
			"placeholder": "Selecteer een integratie",
			"defined": "Gedefinieerd",
			"undefined": "Ongedefinieerd",
			"public": "Openbaar",
			"private": "Privé",
			"explanationPublic": "Er wordt een privé geheim naar de server gestuurd. Zodra uw browser de pagina heeft ververst, wordt deze nooit meer naar de client gestuurd.",
			"explanationPrivate": "Een public secret wordt altijd naar de client gestuurd en is toegankelijk via de API. Het mag geen vertrouwelijke waarden bevatten zoals gebruikersnamen, wachtwoorden, tokens, certificaten en dergelijke"
		},
		"secrets": {
			"description": "Om een geheim bij te werken, voert u een waarde in en klikt u op de knop Opslaan. Om een geheim te verwijderen, gebruikt u de knop wissen.",
			"warning": "Uw gegevens fungeren als de toegang tot uw integraties en u zou deze <strong>nooit</strong> moeten delen met iemand anders. Het officiële Homarr team zal nooit om inloggegevens vragen. Zorg ervoor dat <strong>u uw geheimen veilig opslaat en beheert</strong>.",
			"clear": "Wis geheim",
			"save": "Geheim opslaan",
			"update": "Update geheim"
		}
	}
}