{
	"tabs": {
		"general": "Generale",
		"behaviour": "Comportamento",
		"network": "Rete",
		"appearance": "Aspetto",
		"integration": "Integrazione"
	},
	"general": {
		"appname": {
			"label": "Nome app",
			"description": "Utilizzato per visualizzare l'app sulla dashboard."
		},
		"internalAddress": {
			"label": "Indirizzo interno",
			"description": "IP interno dell'app.",
			"troubleshoot": {
				"label": "Problemi?",
				"header": "Ecco un elenco degli errori più comuni e della risoluzione dei problemi:",
				"lines": {
					"nothingAfterPort": "Nella maggior parte dei casi, se non in tutti, non dovresti inserire alcun percorso dopo la porta. (Anche \"/admin\" per pihole o \"/web\" per plex)",
					"protocolCheck": "Assicurati sempre che l'URL sia preceduto da http o https e assicurati di utilizzare quello giusto.",
					"preferIP": "Si consiglia di utilizzare l'IP diretto della macchina o del container con cui si tenta di comunicare.",
					"enablePings": "Verifica che l'IP sia corretto abilitando i ping. Personalizza scheda -> Layout -> Abilita ping. Una piccola bolla rossa o verde apparirà sui riquadri dell'app e, passandoci sopra, ti verrà fornito il codice di risposta (nella maggior parte dei casi è prevista una bolla verde con il codice 200).",
					"wget": "Per assicurarti che homarr possa comunicare con le altre app, assicurati di fare wget/curl/ping all'IP:porta dell'app.",
					"iframe": "Quando si tratta di iframe, questi dovrebbero sempre utilizzare lo stesso protocollo (http/s) di Homarr.",
					"clearCache": "Alcune informazioni sono registrate nella cache, quindi l'integrazione potrebbe non funzionare a meno che non si pulisca la cache nelle opzioni generali di Homarr."
				},
				"footer": "Per ulteriori informazioni sulla risoluzione dei problemi, contatta il nostro {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Indirizzo esterno",
			"description": "URL che verrà aperto nel browser al clic dell'app.",
			"tooltip": "È possibile utilizzare alcune variabili per creare indirizzi dinamici:<br><br><b>[homarr_base]</b> : indirizzo completo escludendo porta e percorso. <i>(Esempio: 'https://subdomain.homarr.dev')</i><br><b>[homarr_hostname]</b> : url di base completo compreso il suo attuale sottodominio. <i>(Esempio: 'subdomain.homarr.dev')</i><br><b>[homarr_domain]</b> : dominio con sottodominio filtrato. <i>(Esempio: `homarr.dev')</i><br><b>[homarr_protocol]</b> : <i>http/https</i><br><br>Queste variabili dipendono dall'url corrente."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Apri in una nuova scheda",
			"description": "Apri l'app in una nuova scheda invece di quella attuale."
		},
		"tooltipDescription": {
			"label": "Descrizione applicazione",
			"description": "Il testo che inserisci apparirà quando passi il mouse sull'app.\nUsalo per dare agli utenti più dettagli sulla tua app o lascia vuoto per non avere nulla."
		},
		"customProtocolWarning": "Si sta utilizzando un protocollo non standard. Questo potrebbe richiedere applicazioni preinstallate e introdurre rischi per la sicurezza. Assicurarsi che il vostro indirizzo sia sicuro e affidabile."
	},
	"network": {
		"statusChecker": {
			"label": "Status checker",
			"description": "Verifica se l'applicazione è online utilizzando una semplice richiesta HTTP(S)."
		},
		"statusCodes": {
			"label": "Codici di stato HTTP",
			"description": "Gli status code HTTP considerati online."
		}
	},
	"appearance": {
		"icon": {
			"label": "Icona App",
			"description": "Iniziare a digitare per trovare un'icona. È anche possibile incollare l'URL di un'immagine per utilizzare un'icona personalizzata.",
			"autocomplete": {
				"title": "Nessun risultato trovato",
				"text": "Prova a usare un termine di ricerca più specifico. Se non riesci a trovare l'icona desiderata, incolla l'URL dell'immagine sopra per un'icona personalizzata"
			},
			"noItems": {
				"title": "Caricamento icone esterne",
				"text": "Questa operazione potrebbe richiedere alcuni secondi"
			}
		},
		"appNameFontSize": {
			"label": "Dimensione font nome app",
			"description": "Imposta la dimensione dei caratteri per la visualizzazione del nome dell'applicazione sul tile."
		},
		"appNameStatus": {
			"label": "Stato del nome dell'app",
			"description": "Scegli dove vuoi che il titolo si mostri, sempre che tu lo voglia.",
			"dropdown": {
				"normal": "Mostra il titolo solo sul tile",
				"hover": "Mostra il titolo solo al passaggio del mouse sul tooltip",
				"hidden": "Non visualizzare per niente"
			}
		},
		"positionAppName": {
			"label": "Posizione Nome App",
			"description": "Posizione del nome dell'app rispetto all'icona.",
			"dropdown": {
				"top": "Sopra",
				"right": "Destra",
				"bottom": "Sotto",
				"left": "Sinistra"
			}
		},
		"lineClampAppName": {
			"label": "Nome App Linea Morsetto",
			"description": "Definisce il numero massimo di righe del titolo. Imposta 0 per un numero illimitato."
		}
	},
	"integration": {
		"type": {
			"label": "Configurazione integrazioni",
			"description": "La configurazione dell'integrazione che verrà utilizzata per connettersi all'applicazione.",
			"placeholder": "Seleziona un'integrazione",
			"defined": "Definito",
			"undefined": "Indefinito",
			"public": "Pubblico",
			"private": "Privato",
			"explanationPrivate": "Un secret privato verrà inviato al server una sola volta. Una volta che il browser avrà aggiornato la pagina, non verrà mai inviato di nuovo.",
			"explanationPublic": "Un secret pubblico sarà sempre inviato al client ed è accessibile tramite API. Non dovrebbe contenere dati sensibili come nomi utente, password, token, certificati e simili!"
		},
		"secrets": {
			"description": "Per aggiornare un secret, inserisci un valore e fai clic sul pulsante Salva. Per rimuoverlo, usa il pulsante rimuovi.",
			"warning": "Le tue credenziali fungono da accesso per le tue integrazioni e non devi <strong>mai</strong> condividerle con nessuno. Il team ufficiale di Homarr non chiederà mai le credenziali. Assicurati di <strong>memorizzare e gestire i tuoi dati privati in modo sicuro</strong>.",
			"clear": "Rimuovi secret",
			"save": "Salva secret",
			"update": "Aggiorna secret"
		}
	},
	"validation": {
		"popover": "Il form contiene dati invalidi. Pertanto, non può essere salvato. Risolvere tutti i problemi e fare nuovamente clic su questo pulsante per salvare le modifiche",
		"name": "Il nome è obbligatorio",
		"noUrl": "L'url è obbligatorio",
		"invalidUrl": "Il valore non è un url valido",
		"noIconUrl": "Questo campo è obbligatorio",
		"noExternalUri": "L'URI esterno è obbligatorio",
		"invalidExternalUri": "L'URI esterno non è un uri valido"
	}
}
