{
	"tabs": {
		"general": "Γενικά",
		"behaviour": "Συμπεριφορά",
		"network": "Δίκτυο",
		"appearance": "Εμφάνιση",
		"integration": "Ενσωμάτωση"
	},
	"general": {
		"appname": {
			"label": "Όνομα εφαρμογής",
			"description": "Χρησιμοποιείται για την εμφάνιση της εφαρμογής στο ταμπλό."
		},
		"internalAddress": {
			"label": "Εσωτερική διεύθυνση",
			"description": "Η εσωτερική διεύθυνση IP της εφαρμογής.",
			"troubleshoot": {
				"label": "Έχετε προβλήματα;",
				"header": "Εδώ είναι μια λίστα με συνήθη λάθη και αντιμετώπιση προβλημάτων:",
				"lines": {
					"nothingAfterPort": "Στις περισσότερες, αν όχι σε όλες τις περιπτώσεις, δεν θα πρέπει να εισαγάγετε καμία διαδρομή μετά τη θύρα. (Ακόμα και το '/admin' για το pihole ή το '/web' για το plex)",
					"protocolCheck": "Βεβαιωθείτε πάντα ότι της διεύθυνσης URL προηγείται το http ή το https, και βεβαιωθείτε ότι χρησιμοποιείτε το σωστό.",
					"preferIP": "Συνιστάται να χρησιμοποιείτε την άμεση ip του μηχανήματος ή του container με το οποίο προσπαθείτε να επικοινωνήσετε.",
					"enablePings": "Ελέγξτε ότι η διεύθυνση IP είναι σωστή ενεργοποιώντας τα pings. Προσαρμογή πίνακα -> Διάταξη -> Ενεργοποίηση pings. Μια μικρή κόκκινη ή πράσινη φούσκα θα εμφανιστεί στα πλακίδια της εφαρμογής σας και αν κρατήσετε από πάνω το ποντίκι σας, θα σας δώσει τον κωδικό απάντησης (στις περισσότερες περιπτώσεις αναμένεται μια πράσινη φούσκα με κωδικό 200).",
					"wget": "Για να βεβαιωθείτε ότι το homarr μπορεί να επικοινωνήσει με τις άλλες εφαρμογές, βεβαιωθείτε ότι μπορείτε να κάνετε wget/curl/ping στην IP:port της εφαρμογής.",
					"iframe": "Όσον αφορά τα iframes, αυτά θα πρέπει πάντα να χρησιμοποιούν το ίδιο πρωτόκολλο (http/s) με το Homarr.",
					"clearCache": "Ορισμένες πληροφορίες καταχωρούνται στην προσωρινή μνήμη, οπότε μια ενσωμάτωση μπορεί να μη λειτουργήσει αν δεν καθαρίσετε την προσωρινή μνήμη στις γενικές επιλογές του Homarr."
				},
				"footer": "Για περισσότερη αντιμετώπιση προβλημάτων, επικοινωνήστε μαζί μας στο {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Εξωτερική διεύθυνση",
			"description": "URL που θα ανοίγει όταν κάνετε κλικ στην εφαρμογή.",
			"tooltip": "Μπορείτε να χρησιμοποιήσετε μερικές μεταβλητές για να δημιουργήσετε δυναμικές διευθύνσεις:<br><br><b>[homarr_base]</b>: πλήρης διεύθυνση χωρίς τη πόρτα και τη διαδρομή. <i>(Παράδειγμα: 'https://subdomain.homarr.dev')</i><br><b>[homarr_hostname]</b>: πλήρες url βάσης συμπεριλαμβανομένου του τρέχοντος subdomain. <i>(Παράδειγμα: 'subdomain.homarr.dev')</i><br><b>[homarr_domain]</b>: domain χωρίς το subdomoain. <i>(Παράδειγμα: `homarr.dev')</i><br><b>[homarr_protocol]</b>: <i>http/https</i><br><br>Όλες αυτές οι μεταβλητές εξαρτώνται από το τρέχον url."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Άνοιγμα σε νέα καρτέλα",
			"description": "Ανοίξτε την εφαρμογή σε νέα καρτέλα αντί της τρέχουσας."
		},
		"tooltipDescription": {
			"label": "Περιγραφή Εφαρμογής",
			"description": "Το κείμενο που εισάγετε θα εμφανίζεται όταν περνάτε το ποντίκι πάνω από την εφαρμογή σας.\nΧρησιμοποιήστε το για να δώσετε στους χρήστες περισσότερες λεπτομέρειες σχετικά με την εφαρμογή σας ή αφήστε το κενό για να μην έχετε τίποτα."
		},
		"customProtocolWarning": "Χρήση μη τυποποιημένου πρωτοκόλλου. Αυτό μπορεί να απαιτεί προεγκατεστημένες εφαρμογές και να εισάγει κινδύνους ασφαλείας. Βεβαιωθείτε ότι η διεύθυνσή σας είναι ασφαλής και αξιόπιστη."
	},
	"network": {
		"statusChecker": {
			"label": "Έλεγχος κατάστασης",
			"description": "Ελέγχει αν η εφαρμογή σας είναι συνδεδεμένη χρησιμοποιώντας ένα απλό αίτημα HTTP(S)."
		},
		"statusCodes": {
			"label": "Κωδικοί κατάστασης HTTP",
			"description": "Οι κωδικοί κατάστασης HTTP που θεωρούνται online."
		}
	},
	"appearance": {
		"icon": {
			"label": "Εικονίδιο εφαρμογής",
			"description": "Αρχίστε να πληκτρολογείτε για να βρείτε ένα εικονίδιο. Μπορείτε επίσης να επικολλήσετε μια διεύθυνση URL εικόνας για να χρησιμοποιήσετε ένα προσαρμοσμένο εικονίδιο.",
			"autocomplete": {
				"title": "Δεν βρέθηκαν αποτελέσματα",
				"text": "Προσπαθήστε να χρησιμοποιήσετε έναν πιο συγκεκριμένο όρο αναζήτησης. Αν δεν μπορείτε να βρείτε το εικονίδιο που επιθυμείτε, επικολλήστε την παραπάνω διεύθυνση URL εικόνας για ένα προσαρμοσμένο εικονίδιο"
			},
			"noItems": {
				"title": "Φόρτωση εξωτερικών εικονιδίων",
				"text": "Αυτό μπορεί να διαρκέσει μερικά δευτερόλεπτα"
			}
		},
		"appNameFontSize": {
			"label": "Μέγεθος Γραμματοσειράς ονόματος Εφαρμογής",
			"description": "Ορίστε το μέγεθος γραμματοσειράς όταν εμφανίζεται το όνομα της εφαρμογής στο πλακίδιο."
		},
		"appNameStatus": {
			"label": "Κατάσταση Ονόματος Εφαρμογής",
			"description": "Επιλέξτε πού θέλετε να εμφανίζεται ο τίτλος, αν θέλετε.",
			"dropdown": {
				"normal": "Εμφάνιση τίτλου μόνο στο πλακίδιο",
				"hover": "Εμφάνιση του τίτλου μόνο στο hover του tooltip",
				"hidden": "Να μην εμφανιστεί ξανά"
			}
		},
		"positionAppName": {
			"label": "Θέση ονόματος εφαρμογής",
			"description": "Θέση του ονόματος της εφαρμογής σε σχέση με το εικονίδιο.",
			"dropdown": {
				"top": "Πάνω",
				"right": "Δεξιά",
				"bottom": "Κάτω",
				"left": "Αριστερά"
			}
		},
		"lineClampAppName": {
			"label": "Περιορισμός γραμμών ονόματος εφαρμογής",
			"description": "Καθορίζει τον αριθμό των γραμμών που πρέπει να χωράει ο τίτλος σας στο μέγιστο. Ορίστε 0 για απεριόριστα."
		}
	},
	"integration": {
		"type": {
			"label": "Διαμόρφωση ενσωμάτωσης",
			"description": "Η διαμόρφωση ενσωμάτωσης που θα χρησιμοποιηθεί για τη σύνδεση με την εφαρμογή σας.",
			"placeholder": "Επιλέξτε Ενσωμάτωση",
			"defined": "Καθορισμένο",
			"undefined": "Απροσδιόριστο",
			"public": "Δημόσιο",
			"private": "Ιδιωτικό",
			"explanationPrivate": "Ένα ιδιωτικό μυστικό θα αποσταλεί στον διακομιστή μόνο μία φορά. Μόλις το πρόγραμμα περιήγησής σας ανανεώσει τη σελίδα, δεν θα αποσταλεί ποτέ ξανά.",
			"explanationPublic": "Ένα δημόσιο μυστικό αποστέλλεται πάντα στον πελάτη και είναι προσβάσιμο μέσω του API. Δεν πρέπει να περιέχει εμπιστευτικές τιμές όπως ονόματα χρηστών, κωδικούς πρόσβασης, μάρκες, πιστοποιητικά και παρόμοια!"
		},
		"secrets": {
			"description": "Για να ενημερώσετε ένα μυστικό, εισαγάγετε μια τιμή και κάντε κλικ στο κουμπί αποθήκευσης. Για να διαγράψετε ένα μυστικό, χρησιμοποιήστε το κουμπί διαγραφής.",
			"warning": "Τα διαπιστευτήριά σας λειτουργούν ως πρόσβαση για τις ενσωματώσεις σας και δεν θα πρέπει <strong>ποτέ </strong> να τα μοιράζεστε με κανέναν άλλον. Η ομάδα Homarr δεν θα σας ζητήσει ποτέ διαπιστευτήρια. Βεβαιωθείτε ότι <strong>αποθηκεύετε και διαχειρίζεστε τα μυστικά σας με ασφάλεια</strong>.",
			"clear": "Καθαρισμός μυστικού",
			"save": "Αποθήκευση μυστικού",
			"update": "Ενημέρωση μυστικού"
		}
	},
	"validation": {
		"popover": "Η φόρμα σας περιέχει άκυρα δεδομένα. Ως εκ τούτου, δεν μπορεί να αποθηκευτεί. Παρακαλούμε επιλύστε όλα τα προβλήματα και κάντε ξανά κλικ σε αυτό το κουμπί για να αποθηκεύσετε τις αλλαγές σας",
		"name": "Απαιτείται όνομα",
		"noUrl": "Απαιτείται διεύθυνση URL",
		"invalidUrl": "Η τιμή δεν είναι έγκυρη διεύθυνση url",
		"noIconUrl": "Αυτό το πεδίο είναι υποχρεωτικό",
		"noExternalUri": "Απαιτείται εξωτερικό URI",
		"invalidExternalUri": "Το εξωτερικό URI δεν είναι έγκυρο uri"
	}
}
