{
	"tabs": {
		"general": "Γενικά",
		"behaviour": "Συμπεριφορά",
		"network": "Δίκτυο",
		"appearance": "Εμφάνιση",
		"integration": "Ενσωμάτωση"
	},
	"general": {
		"appname": {
			"label": "Όνομα εφαρμογής",
			"description": "Χρησιμοποιείται για την εμφάνιση της εφαρμογής στο ταμπλό."
		},
		"internalAddress": {
			"label": "Εσωτερική διεύθυνση",
			"description": "Η εσωτερική διεύθυνση IP της εφαρμογής."
		},
		"externalAddress": {
			"label": "Εξωτερική διεύθυνση",
			"description": "URL που θα ανοίγει όταν κάνετε κλικ στην εφαρμογή."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Άνοιγμα σε νέα καρτέλα",
			"description": "Ανοίξτε την εφαρμογή σε νέα καρτέλα αντί της τρέχουσας."
		},
		"customProtocolWarning": "Χρήση μη τυποποιημένου πρωτοκόλλου. Αυτό μπορεί να απαιτεί προεγκατεστημένες εφαρμογές και να εισάγει κινδύνους ασφαλείας. Βεβαιωθείτε ότι η διεύθυνσή σας είναι ασφαλής και αξιόπιστη."
	},
	"network": {
		"statusChecker": {
			"label": "Έλεγχος κατάστασης",
			"description": "Ελέγχει αν η εφαρμογή σας είναι συνδεδεμένη χρησιμοποιώντας ένα απλό αίτημα HTTP(S)."
		},
		"statusCodes": {
			"label": "Κωδικοί κατάστασης HTTP",
			"description": "Οι κωδικοί κατάστασης HTTP που θεωρούνται online."
		}
	},
	"appearance": {
		"icon": {
			"label": "Εικονίδιο εφαρμογής",
			"description": "Αρχίστε να πληκτρολογείτε για να βρείτε ένα εικονίδιο. Μπορείτε επίσης να επικολλήσετε μια διεύθυνση URL εικόνας για να χρησιμοποιήσετε ένα προσαρμοσμένο εικονίδιο.",
			"autocomplete": {
				"title": "Δεν βρέθηκαν αποτελέσματα",
				"text": "Προσπαθήστε να χρησιμοποιήσετε έναν πιο συγκεκριμένο όρο αναζήτησης. Αν δεν μπορείτε να βρείτε το εικονίδιο που επιθυμείτε, επικολλήστε την παραπάνω διεύθυνση URL εικόνας για ένα προσαρμοσμένο εικονίδιο"
			},
			"noItems": {
				"title": "Φόρτωση εξωτερικών εικονιδίων",
				"text": "Αυτό μπορεί να διαρκέσει μερικά δευτερόλεπτα"
			}
		}
	},
	"integration": {
		"type": {
			"label": "Διαμόρφωση ενσωμάτωσης",
			"description": "Η διαμόρφωση ενσωμάτωσης που θα χρησιμοποιηθεί για τη σύνδεση με την εφαρμογή σας.",
			"placeholder": "Επιλέξτε Ενσωμάτωση",
			"defined": "Καθορισμένο",
			"undefined": "Απροσδιόριστο",
			"public": "Δημόσιο",
			"private": "Ιδιωτικό",
			"explanationPrivate": "Ένα ιδιωτικό μυστικό θα αποσταλεί στον διακομιστή μόνο μία φορά. Μόλις το πρόγραμμα περιήγησής σας ανανεώσει τη σελίδα, δεν θα αποσταλεί ποτέ ξανά.",
			"explanationPublic": "Ένα δημόσιο μυστικό αποστέλλεται πάντα στον πελάτη και είναι προσβάσιμο μέσω του API. Δεν πρέπει να περιέχει εμπιστευτικές τιμές όπως ονόματα χρηστών, κωδικούς πρόσβασης, μάρκες, πιστοποιητικά και παρόμοια!"
		},
		"secrets": {
			"description": "Για να ενημερώσετε ένα μυστικό, εισαγάγετε μια τιμή και κάντε κλικ στο κουμπί αποθήκευσης. Για να διαγράψετε ένα μυστικό, χρησιμοποιήστε το κουμπί διαγραφής.",
			"warning": "Τα διαπιστευτήριά σας λειτουργούν ως πρόσβαση για τις ενσωματώσεις σας και δεν θα πρέπει <strong>ποτέ </strong> να τα μοιράζεστε με κανέναν άλλον. Η ομάδα Homarr δεν θα σας ζητήσει ποτέ διαπιστευτήρια. Βεβαιωθείτε ότι <strong>αποθηκεύετε και διαχειρίζεστε τα μυστικά σας με ασφάλεια</strong>.",
			"clear": "Καθαρισμός μυστικού",
			"save": "Αποθήκευση μυστικού",
			"update": "Ενημέρωση μυστικού"
		}
	},
	"validation": {
		"popover": "Η φόρμα σας περιέχει άκυρα δεδομένα. Ως εκ τούτου, δεν μπορεί να αποθηκευτεί. Παρακαλούμε επιλύστε όλα τα προβλήματα και κάντε ξανά κλικ σε αυτό το κουμπί για να αποθηκεύσετε τις αλλαγές σας"
	}
}
