{
	"tabs": {
		"general": "Allgemein",
		"behaviour": "Verhalten",
		"network": "Netzwerk",
		"appearance": "Aussehen",
		"integration": "Integration"
	},
	"general": {
		"appname": {
			"label": "Anwendungsname",
			"description": "Wird für die Anzeige der App auf dem Dashboard verwendet."
		},
		"internalAddress": {
			"label": "Interne Adresse",
			"description": "Interne IP-Adresse der Anwendung.",
			"troubleshoot": {
				"label": "Haben Sie Probleme?",
				"header": "Hier finden Sie eine Liste der am häufigsten gemachten Fehler und deren Behebung:",
				"lines": {
					"nothingAfterPort": "Sie sollten in den meisten Fällen keinen Pfad nach dem Port eingeben (z.b. auch '/admin' für Pihole oder '/web' für Plex)",
					"protocolCheck": "Achten Sie immer darauf, dass der URL ein http oder https vorangestellt ist, und stellen Sie sicher, dass Sie die richtige URL verwenden.",
					"preferIP": "Es wird empfohlen, die direkte IP-Adresse der Maschine oder des Containers zu verwenden, mit der/dem Sie kommunizieren möchten.",
					"enablePings": "Prüfen Sie, ob die IP erreichbar ist, indem Sie Pings aktivieren. Passen Sie das Board an -> Layout -> Pings aktivieren. Eine kleine rote oder grüne Blase erscheint auf Ihren App-Kacheln und wenn Sie sie anklicken, wird der Antwortcode angezeigt (in den meisten Fällen wird eine grüne Blase mit dem Code 200 erwartet).",
					"wget": "Um sicherzustellen, dass homarr mit den anderen Anwendungen kommunizieren kann, stellen Sie sicher, dass Sie mit wget/curl/ping die IP:Port der Anwendung ermitteln.",
					"iframe": "Wenn es um iframes geht, sollten diese immer das gleiche Protokoll (http/s) wie Homarr verwenden.",
					"clearCache": "Einige Informationen werden im Cache gespeichert, so dass eine Integration möglicherweise nicht funktioniert, bis Sie den Cache in den allgemeinen Optionen von Homarr löschen."
				},
				"footer": "Für weitere Fehlerbehebungen wenden Sie sich bitte an unseren {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Externe Adresse",
			"description": "URL, die beim Anklicken der App geöffnet wird.",
			"tooltip": "Sie können einige Variablen verwenden, um dynamische Adressen zu erstellen:<br><br><b>[homarr_base]</b> : vollständige Adresse ohne Port und Pfad. <i>(Beispiel: „https://subdomain.homarr.dev“)</i><br><b>[homarr_hostname]</b> : vollständige Basis-URL einschließlich der aktuellen Subdomäne. <i>(Beispiel: „subdomain.homarr.dev“)</i><br><b>[homarr_domain]</b> : Domäne mit herausgefilterter Subdomäne. <i>(Beispiel: „homarr.dev“)</i><br><b>[homarr_protocol]</b> : <i>http/https</i><br><br>Diese Variablen hängen alle von der aktuellen URL ab."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "In neuem Tab öffnen",
			"description": "Öffnen Sie die App in einer neuen Registerkarte, anstatt in der aktuellen Registerkarte."
		},
		"tooltipDescription": {
			"label": "Beschreibung der Anwendung",
			"description": "Dieser von Ihnen eingegebene Text wird angezeigt, wenn Sie den Mauszeiger über Ihre App bewegen.\nVerwenden Sie diesen Text, um den Nutzern mehr Informationen über Ihre App zu geben, oder lassen Sie ihn leer, um nichts anzuzeigen."
		},
		"customProtocolWarning": "Verwendung eines nicht standardmäßigen Protokolls. Dies kann vorinstallierte Anwendungen erfordern und Sicherheitsrisiken einbringen. Stellen Sie sicher, dass Ihre Adresse sicher und vertrauenswürdig ist."
	},
	"network": {
		"statusChecker": {
			"label": "Statusprüfer",
			"description": "Prüft, ob Ihre Anwendung mittels einer einfachen HTTP(S)-Anfrage erreichbar ist."
		},
		"statusCodes": {
			"label": "HTTP Statuscodes",
			"description": "Die HTTP-Statuscodes, die als online angesehen werden."
		}
	},
	"appearance": {
		"icon": {
			"label": "App Symbol",
			"description": "Beginnen Sie zu tippen, um ein Symbol zu finden. Sie können auch eine Bild-URL einfügen, um ein benutzerdefiniertes Symbol zu verwenden.",
			"autocomplete": {
				"title": "Die Suche ergab keine Treffer",
				"text": "Versuchen Sie, einen spezifischeren Suchbegriff zu verwenden. Wenn Sie das gewünschte Symbol nicht finden können, fügen Sie die obige Bild-URL für ein benutzerdefiniertes Symbol ein"
			},
			"noItems": {
				"title": "Lade externe Icons",
				"text": "Dies kann einige Sekunden dauern…"
			}
		},
		"appNameFontSize": {
			"label": "Schriftgröße für App Namen",
			"description": "Legen Sie die Schriftgröße für die Anzeige des App-Namens auf der Kachel fest."
		},
		"appNameStatus": {
			"label": "App-Namensstatus",
			"description": "Wählen Sie, wo der Titel angezeigt werden soll, wenn überhaupt.",
			"dropdown": {
				"normal": "Titel nur auf Kachel anzeigen",
				"hover": "Titel nur bei Halten des Mauszeigers über den Tooltip anzeigen",
				"hidden": "Nicht anzeigen"
			}
		},
		"positionAppName": {
			"label": "Position des App-Namen",
			"description": "Position des App-Namens in Relation zum Symbol.",
			"dropdown": {
				"top": "Oben",
				"right": "Rechts",
				"bottom": "Unten",
				"left": "Links"
			}
		},
		"lineClampAppName": {
			"label": "App-Namen Linienumbruch",
			"description": "Legt fest, auf wie viele Zeilen Ihr Titel maximal passen soll. Setzen Sie 0 für unbegrenzt."
		}
	},
	"integration": {
		"type": {
			"label": "Integrations-Konfiguration",
			"description": "Die Integrationskonfiguration, die für die Verbindung mit Ihrer Anwendung verwendet wird.",
			"placeholder": "Integration auswählen",
			"defined": "Definiert",
			"undefined": "Nicht definiert",
			"public": "Öffentlich sichtbar",
			"private": "Privat",
			"explanationPrivate": "Ein private Phrase wird nur einmal an den Server gesendet. Sobald Ihr Browser die Seite aktualisiert hat, wird es nie wieder gesendet.",
			"explanationPublic": "Ein öffentliche Phrase wird immer an den Client gesendet und ist über die API zugänglich. Es sollte keine vertraulichen Werte wie Benutzernamen, Passwörter, Token, Zertifikate und ähnliches enthalten!"
		},
		"secrets": {
			"description": "Um eine geheime Phrase zu aktualisieren, geben Sie einen Wert ein und klicken Sie auf Speichern. Um eine geheime Phrase zu entfernen, klicken Sie auf die Schaltfläche Löschen.",
			"warning": "Ihre Anmeldedaten dienen als Zugang für Homarr und sie sollten diese <strong>niemals</strong> an andere Personen weitergeben. Das Homarr-Team wird Sie niemals nach Ihren Zugangsdaten fragen. Stellen Sie sicher, dass sie ihre <strong>Zugangsdaten sicher aufbewahren und verwalten</strong>.",
			"clear": "Geheime Phrase löschen",
			"save": "Geheime Phrase speichern",
			"update": "Geheime Phrase ändern"
		}
	},
	"validation": {
		"popover": "Ihr Formular enthält ungültige Angaben, daher konnte es nicht gespeichert werden. Bitte beseitigen Sie diese ungültigen Angaben und klicken Sie erneut auf diesen Button, um Ihre Änderungen zu speichern",
		"name": "Der Name ist erforderlich",
		"noUrl": "URL erforderlich",
		"invalidUrl": "Der Wert ist keine gültige URL",
		"noIconUrl": "Dieses Feld ist erforderlich",
		"noExternalUri": "Externe URL ist erforderlich",
		"invalidExternalUri": "Externe URL ist keine gültige URL"
	}
}
