{
	"tabs": {
		"general": "Allgemein",
		"behaviour": "Verhalten",
		"network": "Netzwerk",
		"appearance": "Aussehen",
		"integration": "Integration"
	},
	"general": {
		"appname": {
			"label": "Anwendungsname",
			"description": "Wird für die Anzeige der App auf dem Dashboard verwendet."
		},
		"internalAddress": {
			"label": "Interne Adresse",
			"description": "Interne IP-Adresse der Anwendung."
		},
		"externalAddress": {
			"label": "Externe Adresse",
			"description": "URL, die beim Anklicken der App geöffnet wird."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "In neuem Tab öffnen",
			"description": "Öffnen Sie die App in einer neuen Registerkarte, anstatt in der aktuellen Registerkarte."
		},
		"customProtocolWarning": "Verwendung eines nicht standardmäßigen Protokolls. Dies kann vorinstallierte Anwendungen erfordern und Sicherheitsrisiken einbringen. Stellen Sie sicher, dass Ihre Adresse sicher und vertrauenswürdig ist."
	},
	"network": {
		"statusChecker": {
			"label": "Statusprüfer",
			"description": "Prüft, ob Ihre Anwendung mittels einer einfachen HTTP(S)-Anfrage erreichbar ist."
		},
		"statusCodes": {
			"label": "HTTP Statuscodes",
			"description": "Die HTTP-Statuscodes, die als online angesehen werden."
		}
	},
	"appearance": {
		"icon": {
			"label": "App Symbol",
			"description": "Beginnen Sie zu tippen, um ein Symbol zu finden. Sie können auch eine Bild-URL einfügen, um ein benutzerdefiniertes Symbol zu verwenden.",
			"autocomplete": {
				"title": "Die Suche ergab keine Treffer",
				"text": "Versuchen Sie, einen spezifischeren Suchbegriff zu verwenden. Wenn Sie das gewünschte Symbol nicht finden können, fügen Sie die obige Bild-URL für ein benutzerdefiniertes Symbol ein"
			},
			"noItems": {
				"title": "Lade externe Icons",
				"text": "Dies kann einige Sekunden dauern…"
			}
		}
	},
	"integration": {
		"type": {
			"label": "Integrations-Konfiguration",
			"description": "Die Integrationskonfiguration, die für die Verbindung mit Ihrer Anwendung verwendet wird.",
			"placeholder": "Integration auswählen",
			"defined": "Definiert",
			"undefined": "Nicht definiert",
			"public": "Öffentlich sichtbar",
			"private": "Privat",
			"explanationPrivate": "Ein private Phrase wird nur einmal an den Server gesendet. Sobald Ihr Browser die Seite aktualisiert hat, wird es nie wieder gesendet.",
			"explanationPublic": "Ein öffentliche Phrase wird immer an den Client gesendet und ist über die API zugänglich. Es sollte keine vertraulichen Werte wie Benutzernamen, Passwörter, Token, Zertifikate und ähnliches enthalten!"
		},
		"secrets": {
			"description": "Um eine geheime Phrase zu aktualisieren, geben Sie einen Wert ein und klicken Sie auf Speichern. Um eine geheime Phrase zu entfernen, klicken Sie auf die Schaltfläche Löschen.",
			"warning": "Ihre Anmeldedaten dienen als Zugang für Homarr und sie sollten diese <strong>niemals</strong> an andere Personen weitergeben. Das Homarr-Team wird Sie niemals nach Ihren Zugangsdaten fragen. Stellen Sie sicher, dass sie ihre <strong>Zugangsdaten sicher aufbewahren und verwalten</strong>.",
			"clear": "Geheime Phrase löschen",
			"save": "Geheime Phrase speichern",
			"update": "Geheime Phrase ändern"
		}
	},
	"validation": {
		"popover": "Ihr Formular enthält ungültige Angaben, daher konnte es nicht gespeichert werden. Bitte beseitigen Sie diese ungültigen Angaben und klicken Sie erneut auf diesen Button, um Ihre Änderungen zu speichern"
	}
}
