{
	"tabs": {
		"general": "Général",
		"behaviour": "Comportement",
		"network": "Réseau",
		"appearance": "Apparence",
		"integration": "Intégration"
	},
	"general": {
		"appname": {
			"label": "Nom de l'application",
			"description": "Utilisé pour afficher l'application sur le tableau de bord."
		},
		"internalAddress": {
			"label": "Adresse interne",
			"description": "IP interne de l'application."
		},
		"externalAddress": {
			"label": "Adresse externe",
			"description": "URL qui sera ouverte dans le navigateur lorsque l'on clique sur l'application."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Ouvrir dans un nouvel onglet",
			"description": "Ouvrez l'application dans un nouvel onglet au lieu de l'onglet actuel."
		},
		"customProtocolWarning": "Utilisation d'un protocole non standard. Ceci peut nécessiter des applications préinstallées et peut introduire des failles de sécurité. Assurez-vous que votre adresse est sécurisée et de confiance."
	},
	"network": {
		"statusChecker": {
			"label": "Vérificateur de statut",
			"description": "Vérifie si votre application est en ligne en utilisant une simple requête HTTP(S)."
		},
		"statusCodes": {
			"label": "Codes d'état HTTP",
			"description": "Les codes d'état HTTP qui sont considérés comme étant en ligne."
		}
	},
	"appearance": {
		"icon": {
			"label": "Icône de l’app",
			"description": "Commencez à taper pour trouver une icône. Vous pouvez également coller l'URL d'une image pour utiliser une icône personnalisée.",
			"autocomplete": {
				"title": "Aucun résultat trouvé",
				"text": "Essayez d'utiliser un terme de recherche plus spécifique. Si vous ne trouvez pas l'icône souhaitée, collez l'URL de l'image ci-dessus pour obtenir une icône personnalisée"
			},
			"noItems": {
				"title": "Chargement d'icônes externes",
				"text": "Cela peut prendre quelques secondes"
			}
		}
	},
	"integration": {
		"type": {
			"label": "Configuration d’intégrations",
			"description": "La configuration d'intégration qui sera utilisée pour se connecter à votre application.",
			"placeholder": "Sélectionner une itégration",
			"defined": "Défini",
			"undefined": "Indéfini",
			"public": "Public",
			"private": "Privé",
			"explanationPrivate": "Un secret privé sera envoyé au serveur. Une fois que votre navigateur a rafraîchi la page. Il ne sera jamais envoyé au client.",
			"explanationPublic": "Un secret public est toujours envoyé au client et est accessible via l'API. Il ne doit pas contenir de valeurs confidentielles telles que des noms d'utilisateur, des mots de passe, des jetons, des certificats et d'autres éléments similaires!"
		},
		"secrets": {
			"description": "Pour mettre à jour un secret, entrez une valeur et cliquez sur le bouton Enregistrer. Pour supprimer un secret, utilisez le bouton Effacer.",
			"warning": "Vos informations d'identification servent d'accès à vos intégrations et vous devez <strong>ne jamais</strong> les partager avec quelqu'un d'autre. L'équipe officielle d'Homarr ne vous demandera jamais vos informations d'identification. Veillez à <strong>stocker et gérer vos secrets en toute sécurité</strong>.",
			"clear": "Effacer le secret",
			"save": "Sauvegarder le secret",
			"update": "Mettre à jour le secret"
		}
	},
	"validation": {
		"popover": "Votre formulaire contient des données invalides et ne peut être sauvegardé. Veuillez résoudre tous les problèmes et cliquez à nouveau sur ce bouton pour enregistrer vos modifications"
	}
}
