{
	"tabs": {
		"general": "Général",
		"behaviour": "Comportement",
		"network": "Réseau",
		"appearance": "Apparence",
		"integration": "Intégration"
	},
	"general": {
		"appname": {
			"label": "Nom de l'application",
			"description": "Utilisé pour afficher l'application sur le tableau de bord."
		},
		"internalAddress": {
			"label": "Adresse interne",
			"description": "IP interne de l'application.",
			"troubleshoot": {
				"label": "Un problème ?",
				"header": "Voici une liste des erreurs les plus courantes et des solutions de dépannage :",
				"lines": {
					"nothingAfterPort": "Dans la plupart des cas, si ce n'est tous, vous ne devez pas saisir de chemin après le port. (Même le '/admin' pour pihole ou '/web' pour plex)",
					"protocolCheck": "Assurez-vous toujours que l'URL est précédé de http ou https, et que vous utilisez le bon.",
					"preferIP": "Il est recommandé d'utiliser l'adresse IP directe de la machine ou du conteneur avec lequel vous essayez de communiquer.",
					"enablePings": "Vérifiez que l'IP est correcte en activant les \"pings\". Personnaliser le tableau de bord -> Mise en page -> Activer les \"pings\". Une petite bulle rouge ou verte apparaîtra sur les tuiles de vos applications et en la survolant, vous verrez le code de réponse (une bulle verte avec le code 200 est attendue dans la plupart des cas).",
					"wget": "Pour s'assurer que homarr peut communiquer avec les autres applications, assurez-vous de wget/curl/ping le combo \"IP:port\" de l'application.",
					"iframe": "En ce qui concerne les iframes, ceux-ci devraient toujours utiliser le même protocole (http/s) que Homarr.",
					"clearCache": "Certaines informations sont enregistrées dans le cache, donc une intégration peut ne pas fonctionner à moins que vous ne vidiez le cache dans les options générales de Homarr."
				},
				"footer": "Pour plus d'aide, contactez nous sûr {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Adresse externe",
			"description": "URL qui sera ouverte dans le navigateur lorsque l'on clique sur l'application.",
			"tooltip": "Vous pouvez utiliser quelques variables pour créer des adresses dynamiques :<br><br><b>[homarr_base]</b>: adresse complète sans le port et le chemin. <i>(Exemple : 'https://subdomain.homarr.dev')</i><br><b>[homarr_hostname]</b>: url de base complète incluant son sous-domaine actuel. <i>(Exemple : 'subdomain.homarr.dev')</i><br><b>[homarr_domain]</b>: domaine dont le sous-domaine est filtré. <i>(Exemple : `homarr.dev')</i><br><b>[homarr_protocol]</b>: <i>http/https</i><br><br>Ces variables dépendent toutes de l'url courante."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Ouvrir dans un nouvel onglet",
			"description": "Ouvrez l'application dans un nouvel onglet au lieu de l'onglet actuel."
		},
		"tooltipDescription": {
			"label": "Description de l'application",
			"description": "Le texte que vous allez entrer apparaitra quand vous survolerez votre application.\nUtilisez cela pour donner plus d'informations aux utilisateurs à propos de votre application ou laissez vide pour qu'il n'y ait rien."
		},
		"customProtocolWarning": "Utilisation d'un protocole non standard. Ceci peut nécessiter des applications préinstallées et peut introduire des failles de sécurité. Assurez-vous que votre adresse est sécurisée et de confiance."
	},
	"network": {
		"statusChecker": {
			"label": "Vérificateur de statut",
			"description": "Vérifie si votre application est en ligne en utilisant une simple requête HTTP(S)."
		},
		"statusCodes": {
			"label": "Codes d'état HTTP",
			"description": "Les codes d'état HTTP qui sont considérés comme étant en ligne."
		}
	},
	"appearance": {
		"icon": {
			"label": "Icône de l’app",
			"description": "Commencez à taper pour trouver une icône. Vous pouvez également coller l'URL d'une image pour utiliser une icône personnalisée.",
			"autocomplete": {
				"title": "Aucun résultat trouvé",
				"text": "Essayez d'utiliser un terme de recherche plus spécifique. Si vous ne trouvez pas l'icône souhaitée, collez l'URL de l'image ci-dessus pour obtenir une icône personnalisée"
			},
			"noItems": {
				"title": "Chargement d'icônes externes",
				"text": "Cela peut prendre quelques secondes"
			}
		},
		"appNameFontSize": {
			"label": "Taille de la police du nom de l'application",
			"description": "Définissez la taille de la police lorsque le nom de l'application est affiché sur la tuile."
		},
		"appNameStatus": {
			"label": "Status du nom de l'application",
			"description": "Choisissez où vous voulez que le titre apparaisse, si vous voulez.",
			"dropdown": {
				"normal": "Afficher le titre sur la tuile uniquement",
				"hover": "Afficher le titre au survol de l'info-bulle uniquement",
				"hidden": "Ne pas afficher du tout"
			}
		},
		"positionAppName": {
			"label": "Position du nom de l'application",
			"description": "Position du nom de l'application par rapport à l'icône.",
			"dropdown": {
				"top": "Au-dessus",
				"right": "Droite",
				"bottom": "En-dessous",
				"left": "Gauche"
			}
		},
		"lineClampAppName": {
			"label": "Coupe ligne pour le nom de l'application",
			"description": "Définissez sur combien de lignes le nom de l'application va s'étendre. 0 pour illimité."
		}
	},
	"integration": {
		"type": {
			"label": "Configuration d’intégrations",
			"description": "La configuration d'intégration qui sera utilisée pour se connecter à votre application.",
			"placeholder": "Sélectionner une intégration",
			"defined": "Défini",
			"undefined": "Indéfini",
			"public": "Public",
			"private": "Privé",
			"explanationPrivate": "Un secret privé sera envoyé au serveur. Une fois que votre navigateur a rafraîchi la page. Il ne sera jamais envoyé au client.",
			"explanationPublic": "Un secret public est toujours envoyé au client et est accessible via l'API. Il ne doit pas contenir de valeurs confidentielles telles que des noms d'utilisateur, des mots de passe, des jetons, des certificats et d'autres éléments similaires!"
		},
		"secrets": {
			"description": "Pour mettre à jour un secret, entrez une valeur et cliquez sur le bouton Enregistrer. Pour supprimer un secret, utilisez le bouton Effacer.",
			"warning": "Vos informations d'identification servent d'accès à vos intégrations et vous devez <strong>ne jamais</strong> les partager avec quelqu'un d'autre. L'équipe officielle d'Homarr ne vous demandera jamais vos informations d'identification. Veillez à <strong>stocker et gérer vos secrets en toute sécurité</strong>.",
			"clear": "Effacer le secret",
			"save": "Sauvegarder le secret",
			"update": "Mettre à jour le secret"
		}
	},
	"validation": {
		"popover": "Votre formulaire contient des données invalides et ne peut être sauvegardé. Veuillez résoudre tous les problèmes et cliquez à nouveau sur ce bouton pour enregistrer vos modifications",
		"name": "Un nom est requis",
		"noUrl": "Un lien est requis",
		"invalidUrl": "La valeur n'est pas une url valide",
		"noIconUrl": "Ce champ est requis",
		"noExternalUri": "Un URI externe est requis",
		"invalidExternalUri": "Cet URI externe n'est pas un URI valide"
	}
}
