{
	"tabs": {
		"general": "Vispārīgi",
		"behaviour": "Uzvedība",
		"network": "Tīkls",
		"appearance": "Izskats",
		"integration": "Integrācija"
	},
	"general": {
		"appname": {
			"label": "Lietotnes nosaukums",
			"description": "Izmanto, lai parādītu lietotni uz informācijas paneļa."
		},
		"internalAddress": {
			"label": "Iekšējā adrese",
			"description": "Lietotnes iekšējā IP adrese.",
			"troubleshoot": {
				"label": "Radušās problēmas?",
				"header": "Šeit ir saraksts ar biežāk pieļautajām kļūdām un to novēršanu:",
				"lines": {
					"nothingAfterPort": "Lielākajā daļā gadījumu, ja ne visos, jums nevajadzētu ievadīt nekādu ceļu pēc porta. (Pat \"/admin\" (pihole gadījumā) vai \"/web\" (plex gadījumā))",
					"protocolCheck": "Vienmēr pārliecinieties, ka pirms URL ir http vai https, un pārliecinieties, ka izmantojat pareizo URL.",
					"preferIP": "Ieteicams izmantot mašīnas vai konteinera, ar kuru mēģināt sazināties, tiešo ip adresi.",
					"enablePings": "Pārbaudiet, vai IP ir pareizs, aktivizējot ping. Pielāgot Dēli -> Izkārtojums -> Ieslēgt ping. Uz lietotnes flīzēm parādīsies mazs sarkans vai zaļš burbulītis, un, uzliekot uz tā kursoru, tiks parādīts atbildes kods (vairumā gadījumu tiek sagaidīts zaļš burbulītis ar kodu 200).",
					"wget": "Lai pārliecinātos, ka homarr var sazināties ar citām lietotnēm, pārliecinieties, ka var veikt wget/curl/ping uz lietotnes IP:ports (piemēram, ping 192.168.1.20:8080).",
					"iframe": "Kad runa ir par iframe, tām vienmēr jāizmanto tas pats protokols (http/s) kā Homarr.",
					"clearCache": "Dažas ziņas tiek reģistrētas kešatmiņā, tāpēc integrācija var nedarboties, ja vien Homarr vispārīgajos iestatījumos neiztīrīsiet kešatmiņu."
				},
				"footer": "Lai iegūtu papildu informāciju par problēmu novēršanu, sazinieties mūsu {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Ārējā adrese",
			"description": "URL, kas tiks atvērts, noklikšķinot uz lietotnes.",
			"tooltip": ""
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Atvērt jaunā cilnē",
			"description": "Atveriet lietotni jaunā cilnē, nevis pašreizējā cilnē."
		},
		"tooltipDescription": {
			"label": "Lietotnes Apraksts",
			"description": "Ievadītais teksts tiks parādīts, kad uz jūsu lietotnes tiks uzvilkts peles kursors.\nIzmantojiet to, lai sniegtu lietotājiem sīkāku informāciju par savu lietotni, vai atstājiet tukšu, lai nekas nebūtu redzams."
		},
		"customProtocolWarning": "Tiek izmantots nestandarta protokols. Tam var būt nepieciešamas iepriekš instalētas lietojumprogrammas, un tas var radīt drošības riskus. Pārliecinieties, ka jūsu adrese ir droša un uzticama."
	},
	"network": {
		"statusChecker": {
			"label": "Stāvokļa pārbaudītājs",
			"description": "Pārbauda, vai lietotne ir tiešsaistē, izmantojot vienkāršu HTTP(S) pieprasījumu."
		},
		"statusCodes": {
			"label": "HTTP statusa kods",
			"description": "HTTP statusa kodi, kas tiek uzskatīti par tiešsaistes statusa kodiem."
		}
	},
	"appearance": {
		"icon": {
			"label": "Lietotnes Ikona",
			"description": "Sāciet rakstīt, lai atrastu ikonu. Varat arī ielīmēt attēla URL, lai izmantotu pielāgotu ikonu.",
			"autocomplete": {
				"title": "Nav atrasts neviens rezultāts",
				"text": "Mēģiniet izmantot konkrētāku meklēšanas terminu. Ja nevarat atrast vēlamo ikonu, ielīmējiet iepriekš norādīto attēla URL, lai iegūtu pielāgotu ikonu"
			},
			"noItems": {
				"title": "Notiek ārējo ikonu ielādēšana",
				"text": "Tas var aizņemt dažas sekundes"
			}
		},
		"appNameFontSize": {
			"label": "Aplikācijas Nosaukuma Fonta Lielums",
			"description": "Iestatiet fonta lielumu, kad lietotnes nosaukums tiek parādīts uz flīzes."
		},
		"appNameStatus": {
			"label": "Lietotnes Nosaukuma Statuss",
			"description": "Izvēlieties, kur vēlaties, lai tiktu parādīts virsraksts, ja vispār to vēlaties parādīt.",
			"dropdown": {
				"normal": "Rādīt virsrakstu tikai uz flīzēm",
				"hover": "Rādīt virsrakstu tikai pēc kursora uzlikšanas uz ekrāna padoma",
				"hidden": "Vairs nerādīt"
			}
		},
		"positionAppName": {
			"label": "Lietotnes Nosaukuma Pozīcija",
			"description": "Lietotnes nosaukuma atrašanās vieta attiecībā pret ikonu.",
			"dropdown": {
				"top": "Augšā",
				"right": "Pa labi",
				"bottom": "Apakšā",
				"left": "Pa kreisi"
			}
		},
		"lineClampAppName": {
			"label": "Lietotnes Nosaukuma Līnijas Aplaušana",
			"description": "Nosaka, cik daudzās rindās maksimāli garš var būt jūsu virsraksts. Iestatiet 0, lai būtu neierobežots skaits."
		}
	},
	"integration": {
		"type": {
			"label": "Integrācijas konfigurācija",
			"description": "Integrācijas konfigurācija, kura tiks izmantota, lai izveidotu savienojumu ar jūsu lietotni.",
			"placeholder": "Izvēlieties integrāciju",
			"defined": "Definēts",
			"undefined": "Nav definēts",
			"public": "Publisks",
			"private": "Privāts",
			"explanationPrivate": "Privātais noslēpums uz serveri tiks nosūtīts tikai vienu reizi. Pēc tam, kad pārlūkprogramma būs atsvaidzinājusi lapu, tas nekad netiks nosūtīts vēlreiz.",
			"explanationPublic": "Publiskais noslēpums vienmēr tiek nosūtīts klientam un ir pieejams, izmantojot API. Tas nedrīkst saturēt nekādas konfidenciālas vērtības, piemēram, lietotājvārdus, paroles, žetonus, sertifikātus un tamlīdzīgi!"
		},
		"secrets": {
			"description": "Lai atjauninātu noslēpumu, ievadiet vērtību un noklikšķiniet uz pogas Saglabāt. Lai dzēstu noslēpumu, noklikšķiniet uz pogas dzēst.",
			"warning": "Jūsu akreditācijas dati kalpo kā piekļuve jūsu integrācijām, un tos <strong>nekad</strong> nevajadzētu kopīgot ar citiem. Homarr komanda nekad nepieprasīs akreditācijas datus. Pārliecinieties, ka <strong>droši glabājat un pārvaldāt savus noslēpumus</strong>.",
			"clear": "Notīrīt noslēpumu",
			"save": "Saglabāt noslēpumu",
			"update": "Atjaunināt noslēpumu"
		}
	},
	"validation": {
		"popover": "Jūsu veidlapā ir nederīgi dati. Tāpēc to nevar saglabāt. Lūdzu, atrisiniet visas problēmas un vēlreiz noklikšķiniet uz šīs pogas, lai saglabātu izmaiņas",
		"name": "Nosaukums ir obligāts",
		"noUrl": "URL ir obligāts",
		"invalidUrl": "Vērtība nav derīgs url",
		"noIconUrl": "Šis lauks ir obligāts",
		"noExternalUri": "Nepieciešams ārējais URI",
		"invalidExternalUri": "Ārējais URI nav derīgs uri"
	}
}
