{
	"tabs": {
		"general": "Generelt",
		"behaviour": "Adfærd",
		"network": "Netværk",
		"appearance": "Udseende",
		"integration": "Integration"
	},
	"general": {
		"appname": {
			"label": "App navn",
			"description": "Bruges til visning af appen på dashboardet."
		},
		"internalAddress": {
			"label": "Intern adresse",
			"description": "Appens interne IP.",
			"troubleshoot": {
				"label": "Har du problemer?",
				"header": "Her er en liste over de mest almindelige fejl og fejlfindingen:",
				"lines": {
					"nothingAfterPort": "Du bør i de fleste, hvis ikke alle, tilfælde ikke indtaste nogen sti efter porten. (Selv '/admin' for pihole eller '/web' for plex)",
					"protocolCheck": "Sørg altid for, at der står http eller https foran URL'en, og sørg for, at du bruger den rigtige.",
					"preferIP": "Det anbefales at bruge den direkte ip på den maskine eller container, du forsøger at kommunikere med.",
					"enablePings": "Tjek, at IP'en er korrekt ved at aktivere pings. Customize Board -> Layout -> Enable pings. En lille rød eller grøn boble vil dukke op på dine app-fliser, og hvis du holder musen over den, får du svarets kode (en grøn boble med kode 200 forventes i de fleste tilfælde).",
					"wget": "For at sikre, at homarr kan kommunikere med de andre apps, skal du sørge for at wget/curl/ping appens IP:port.",
					"iframe": "Når det gælder iframes, skal de altid bruge den samme protokol (http/s) som Homarr.",
					"clearCache": "Nogle oplysninger er registreret i cachen, så en integration virker måske ikke, medmindre du rydder cachen i Homarrs generelle indstillinger."
				},
				"footer": "For yderligere fejlfinding, kontakt os på vores {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Ekstern adresse",
			"description": "URL-adresse, der åbnes, når du klikker på appen.",
			"tooltip": "Du kan bruge nogle få variabler til at oprette dynamiske adresser:<br><br><b>[homarr_base]</b>: fuld adresse uden port og sti. <i>(Eksempel: 'https://subdomain.homarr.dev'</i>)<br><b>[homarr_hostname]</b>: fuld base-url inklusive det aktuelle subdomæne. (Eksempel: ' <i>subdomain.homarr.dev')</i><br><b>[homarr_domain]</b>: domæne med subdomæne filtreret ud. (Eksempel: <i>`homarr.dev</i>')<br><b>[homarr_protocol]</b>: <i>http/https</i><br><br>Disse variabler afhænger alle af den aktuelle url."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Åbn i nyt faneblad",
			"description": "Åbn appen i en ny fane i stedet for den aktuelle fane."
		},
		"tooltipDescription": {
			"label": "Applikationsbeskrivelse",
			"description": "Den tekst, du indtaster, vises, når du holder musen over din app.\nBrug den til at give brugerne flere detaljer om din app, eller lad den stå tom, hvis du ikke vil have noget."
		},
		"customProtocolWarning": "Brug af en ikke-standardiseret protokol. Dette kan kræve forudinstallerede programmer og kan medføre sikkerhedsrisici. Sørg for, at din adresse er sikker og pålidelig."
	},
	"network": {
		"statusChecker": {
			"label": "Statuskontrol",
			"description": "Kontrollerer, om din app er online ved hjælp af en simpel HTTP(S)-anmodning."
		},
		"statusCodes": {
			"label": "HTTP statuskoder",
			"description": "De HTTP-statuskoder, der betragtes som online."
		}
	},
	"appearance": {
		"icon": {
			"label": "App Ikon",
			"description": "Begynd at skrive for at finde et ikon. Du kan også indsætte en billed-URL for at bruge et brugerdefineret ikon.",
			"autocomplete": {
				"title": "Ingen resultater fundet",
				"text": "Prøv at bruge et mere specifikt søgeord. Hvis du ikke kan finde det ønskede ikon, kan du indsætte billedets URL ovenfor for at få et brugerdefineret ikon"
			},
			"noItems": {
				"title": "Indlæser eksterne ikoner",
				"text": "Dette kan tage nogle sekunder"
			}
		},
		"appNameFontSize": {
			"label": "Appnavn Skriftstørrelse",
			"description": "Indstil skriftstørrelsen, når appens navn vises på flisen."
		},
		"appNameStatus": {
			"label": "App Navn Status",
			"description": "Vælg, hvor du vil have titlen vist, hvis den overhovedet skal vises.",
			"dropdown": {
				"normal": "Vis kun titel på flise",
				"hover": "Vis kun titel på tooltip hover",
				"hidden": "Vis slet ikke"
			}
		},
		"positionAppName": {
			"label": "App Navn Position",
			"description": "Placering af appens navn i forhold til ikonet.",
			"dropdown": {
				"top": "Top",
				"right": "Højre",
				"bottom": "Bund",
				"left": "Venstre"
			}
		},
		"lineClampAppName": {
			"label": "App Navn Linje Klemme",
			"description": "Definerer hvor mange linjer din titel skal passe til det maksimale. Sæt 0 for ubegrænset."
		}
	},
	"integration": {
		"type": {
			"label": "Konfiguration af integration",
			"description": "Den integrationskonfiguration, der skal bruges til at oprette forbindelse til din app.",
			"placeholder": "Vælg en integration",
			"defined": "Defineret",
			"undefined": "Udefineret",
			"public": "Offentlig",
			"private": "Privat",
			"explanationPrivate": "En privat hemmelighed sendes kun én gang til serveren. Når din browser har opdateret siden, vil den aldrig blive sendt igen.",
			"explanationPublic": "En offentlig hemmelighed vil altid blive sendt til klienten og er tilgængelig via API'en. Den bør ikke indeholde fortrolige værdier som f. eks. brugernavne, adgangskoder, tokens, certifikater og lignende!"
		},
		"secrets": {
			"description": "Hvis du vil opdatere en hemmelighed, skal du indtaste en værdi og klikke på knappen Gem. Hvis du vil fjerne en hemmelighed, skal du bruge knappen \"clear\".",
			"warning": "Dine legitimationsoplysninger fungerer som adgang til dine integrationer, og du bør <strong>aldrig</strong> dele dem med andre. Det officielle Homarr-team vil aldrig bede om legitimationsoplysninger. Sørg for at <strong>opbevare og administrere dine hemmeligheder sikkert</strong>.",
			"clear": "Ryd hemmelighed",
			"save": "Gem hemmelighed",
			"update": "Opdater hemmelighed"
		}
	},
	"validation": {
		"popover": "Din formular indeholder ugyldige data. Derfor kan den ikke gemmes. Løs alle problemer og klik på denne knap igen for at gemme dine ændringer",
		"name": "Navn er obligatorisk",
		"noUrl": "Url er obligatorisk",
		"invalidUrl": "Værdien er ikke en gyldig url",
		"noIconUrl": "Dette felt er påkrævet",
		"noExternalUri": "Ekstern URI er påkrævet",
		"invalidExternalUri": "Ekstern URI er ikke en gyldig uri"
	}
}
