{
	"tabs": {
		"general": "Chung",
		"behaviour": "Hành vi",
		"network": "Mạng",
		"appearance": "Hiển thị",
		"integration": "Tích hợp"
	},
	"general": {
		"appname": {
			"label": "Tên ứng dụng",
			"description": "Tên dùng để hiển thị trên bảng điều khiển."
		},
		"internalAddress": {
			"label": "Địa chỉ nội bộ",
			"description": "Địa chỉ IP nội bộ của ứng dụng.",
			"troubleshoot": {
				"label": "Có vấn đề?",
				"header": "Dưới đây là danh sách các lỗi thường gặp và cách khắc phục:",
				"lines": {
					"nothingAfterPort": "Trong hầu hết nếu không phải tất cả các trường hợp, bạn không nên nhập bất kỳ đường dẫn nào sau cổng. (Ngay cả '/admin' cho pihole hoặc '/web' cho plex)",
					"protocolCheck": "Luôn đảm bảo rằng URL được bắt đầu bằng http hoặc https và đảm bảo bạn đang sử dụng đúng URL.",
					"preferIP": "Bạn nên sử dụng ip trực tiếp của máy hoặc vùng chứa mà bạn đang cố gắng liên lạc.",
					"enablePings": "Kiểm tra xem IP có đúng không bằng cách bật ping. Tùy chỉnh Bảng -> Bố cục -> Bật ping. Một bong bóng nhỏ màu đỏ hoặc xanh lục sẽ xuất hiện trên ô ứng dụng của bạn và di chuột vào nó sẽ cung cấp cho bạn mã phản hồi (trong hầu hết các trường hợp, bong bóng màu xanh lá cây có mã 200 được mong đợi).",
					"wget": "Để đảm bảo rằng homarr có thể giao tiếp với các ứng dụng khác, hãy đảm bảo wget/curl/ping IP:port của ứng dụng.",
					"iframe": "Khi nói đến iframe, những iframe đó phải luôn sử dụng cùng một giao thức (http/s) như Homarr.",
					"clearCache": "Một số thông tin được đăng ký trong bộ đệm, do đó quá trình tích hợp có thể không hoạt động trừ khi bạn xóa bộ đệm trong các tùy chọn chung của Homarr."
				},
				"footer": "Để biết thêm cách khắc phục sự cố, hãy liên hệ với {{discord}}của chúng tôi."
			}
		},
		"externalAddress": {
			"label": "Địa chỉ bên ngoài",
			"description": "Đường dẫn được mở khi nhấp vào ứng dụng.",
			"tooltip": "Bạn có thể sử dụng một số biến để tạo địa chỉ động: <br><br><b>[homarr_base]</b>: địa chỉ đầy đủ không bao gồm cổng và đường dẫn. <i>(Ví dụ: 'https://tênmiềnphụ.homarr.dev')</i><br><b>[homarr_hostname]</b>: URL cơ sở hoàn chỉnh, bao gồm cả tên miền phụ hiện tại. <i>(Ví dụ: 'tênmiềnphụ.homarr.dev')</i><br><b>[homarr_domain]</b>: tên miền với tên miền phụ được lọc ra. <i>(Ví dụ: \"homarr.dev\")</i><br><b>[homarr_protocol]</b>:<i>http/https</i><br><br>Các biến này phụ thuộc vào URL hiện tại."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Mở trong tab mới",
			"description": "Mở ứng dụng trong tab mới thay vì tab hiện tại."
		},
		"tooltipDescription": {
			"label": "Mô tả ứng dụng",
			"description": "Văn bản bạn nhập sẽ xuất hiện khi di chuột qua ứng dụng của bạn.\r\nSử dụng mục này để cung cấp cho người dùng thêm thông tin chi tiết về ứng dụng của bạn hoặc để trống nếu không có gì."
		},
		"customProtocolWarning": "Sử dụng một giao thức không chuẩn. Điều này có thể yêu cầu các ứng dụng được cài đặt sẵn và có thể gây ra rủi ro bảo mật. Đảm bảo rằng địa chỉ của bạn được an toàn và đáng tin cậy."
	},
	"network": {
		"statusChecker": {
			"label": "Kiểm tra trạng thái",
			"description": "Kiểm tra trạng thái trực tuyến cửa ứng dụng bằng một yêu cầu HTTP(S) đơn giản."
		},
		"statusCodes": {
			"label": "Mã trạng thái HTTP",
			"description": "Các mã trạng thái HTTP được coi là trực tuyến."
		}
	},
	"appearance": {
		"icon": {
			"label": "Biểu tượng ứng dụng",
			"description": "Bạn có thể tìm kiếm biểu tượng bằng cách nhập hoặc dán URL của biểu tượng tùy chỉnh.",
			"autocomplete": {
				"title": "Không có kết quả",
				"text": "Hãy thử sử dụng cụm từ tìm kiếm cụ thể hơn. Nếu bạn không tìm thấy biểu tượng mình muốn, hãy dán URL hình ảnh vào bên trên để dùng biểu tượng tùy chỉnh"
			},
			"noItems": {
				"title": "Đang tải biểu tượng ngoài",
				"text": "Có thể mất vài giây"
			}
		},
		"appNameFontSize": {
			"label": "Tên ứng dụng Kích thước phông chữ",
			"description": "Đặt kích thước phông chữ khi tên ứng dụng được hiển thị trên ô."
		},
		"appNameStatus": {
			"label": "Trạng thái tên ứng dụng",
			"description": "Chọn nơi bạn muốn tiêu đề hiển thị, nếu có.",
			"dropdown": {
				"normal": "Chỉ hiển thị tiêu đề trên ô",
				"hover": "Chỉ hiển thị tiêu đề trên chú giải công cụ khi di chuột",
				"hidden": "Không hiển thị chút nào"
			}
		},
		"positionAppName": {
			"label": "Tên ứng dụng Vị trí",
			"description": "Vị trí của tên ứng dụng so với biểu tượng.",
			"dropdown": {
				"top": "Đứng đầu",
				"right": "Phải",
				"bottom": "Đáy",
				"left": "Bên trái"
			}
		},
		"lineClampAppName": {
			"label": "Tên ứng dụng Kẹp dòng",
			"description": "Xác định số dòng mà tiêu đề của bạn phải phù hợp tối đa. Đặt 0 cho không giới hạn."
		}
	},
	"integration": {
		"type": {
			"label": "Cấu hình tích hợp",
			"description": "Cấu hình tích hợp sẽ được sử dụng để kết nối ứng dụng của bạn.",
			"placeholder": "Chọn loại tích hợp",
			"defined": "Đã định",
			"undefined": "Chưa định",
			"public": "Công khai",
			"private": "Riêng tư",
			"explanationPrivate": "Một bí mật riêng tư sẽ chỉ được gửi đến máy chủ một lần. Khi trình duyệt của bạn đã làm mới trang, nó sẽ không bao giờ được gửi lại nữa.",
			"explanationPublic": "Một bí mật công khai sẽ luôn được gửi tới ứng dụng khách và có thể truy cập được qua API. Nó không được chứa bất kỳ giá trị bí mật nào như tên người dùng, mật khẩu, mã thông báo, chứng chỉ, v.v!"
		},
		"secrets": {
			"description": "Để cập nhật một bí mật, hãy nhập một giá trị và nhấp vào nút Lưu. Để xóa một bí mật, hãy sử dụng nút Xóa bí mật.",
			"warning": "Thông tin đăng nhập của bạn dùng để truy cập vào tích hợp và bạn nên <strong>đừng bao giờ</strong> chia sẻ chúng với bất kỳ ai. Nhóm Homarr sẽ không bao giờ yêu cầu thông tin đăng nhập. Hãy nhớ <strong>lưu trữ và quản lý khóa của bạn một cách an toàn</strong>.",
			"clear": "Xóa bí mật",
			"save": "Lưu bí mật",
			"update": "Cập nhật bí mật"
		}
	},
	"validation": {
		"popover": "Biểu mẫu của bạn chứa dữ liệu không hợp lệ, vì vậy không thể lưu nó. Vui lòng khắc phục mọi vấn đề và nhấp lại vào nút này để lưu các thay đổi của bạn",
		"name": "Tên là bắt buộc",
		"noUrl": "Url là bắt buộc",
		"invalidUrl": "Giá trị không phải là url hợp lệ",
		"noIconUrl": "Trường này là bắt buộc",
		"noExternalUri": "URI bên ngoài là bắt buộc",
		"invalidExternalUri": "URI bên ngoài không phải là uri hợp lệ"
	}
}
