{
	"tabs": {
		"general": "General",
		"behaviour": "Behavior",
		"network": "Network",
		"appearance": "Appearance",
		"integration": "Integration"
	},
	"general": {
		"appname": {
			"label": "App name",
			"description": "Used to display the app on the dashboard."
		},
		"internalAddress": {
			"label": "Internal address",
			"description": "Internal IP-address of the app.",
			"troubleshoot": {
				"label": "Having issues?",
				"header": "Here is a list of commonly made mistake and troubleshooting:",
				"lines": {
					"nothingAfterPort": "You should, in most if not all cases, not input any path after the port. (Even the '/admin' for pihole or '/web' for plex)",
					"protocolCheck": "Always make sure that the URL is preceded by http or https, and to make sure you are using the right one.",
					"preferIP": "It is recommended to use the direct ip of the machine or container you are trying to communicate with.",
					"enablePings": "Check that the IP is right by enabling pings. Customize Board -> Layout -> Enable pings. A little red or green bubble will appear on your app tiles and hovering it will give you it's response code (A green bubble with code 200 is expected in most cases).",
					"wget": "To make sure that homarr can communicate with the other apps, make sure to wget/curl/ping the app's IP:port.",
					"iframe": "When it comes to iframes, those should always be using the same protocol (http/s) as Homarr.",
					"clearCache": "Some informations are registered in cache, so an integration might not work unless you clear the cache in Homarr's general options."
				},
				"footer": "For more troubleshooting, reach out on our {{discord}}."
			}
		},
		"externalAddress": {
			"label": "External address",
			"description": "URL that will be opened when clicking on the app.",
			"tooltip": "You can use a few variables to create dynamic addresses:<br><br><b>[homarr_base]</b> : full address excluding port and path. <i>(Example: 'https://subdomain.homarr.dev')</i><br><b>[homarr_hostname]</b> : full base url including it's current subdomain. <i>(Example: 'subdomain.homarr.dev')</i><br><b>[homarr_domain]</b> : domain with subdomain filtered out. <i>(Example: `homarr.dev')</i><br><b>[homarr_protocol]</b> : <i>http/https</i><br><br>These variables all depend on the current url."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Open in new tab",
			"description": "Open the app in a new tab instead of the current one."
		},
		"tooltipDescription": {
			"label": "Application Description",
			"description": "The text you enter will appear when hovering over your app.\r\nUse this to give users more details about your app or leave empty to have nothing."
		},
		"customProtocolWarning": "Using a non-standard protocol. This may require pre-installed applications and can introduce security risks. Ensure that your address is secure and trusted."
	},
	"network": {
		"statusChecker": {
			"label": "Status checker",
			"description": "Checks if your app is online using a simple HTTP(S) request."
		},
		"statusCodes": {
			"label": "HTTP status codes",
			"description": "The HTTP status codes that are considered as online."
		}
	},
	"appearance": {
		"icon": {
			"label": "App Icon",
			"description": "Start typing to find an icon. You can also paste an image URL to use a custom icon.",
			"autocomplete": {
				"title": "No results found",
				"text": "Try to use a more specific search term. If you can't find your desired icon, paste the image URL above for a custom icon"
			},
			"noItems": {
				"title": "Loading external icons",
				"text": "This may take a few seconds"
			}
		},
		"appNameFontSize": {
			"label": "App Name Font Size",
			"description": "Set the font size for when the app name is shown on the tile."
		},
		"appNameStatus": {
			"label": "App Name Status",
			"description": "Choose where you want the title to show up, if at all.",
			"dropdown": {
				"normal": "Show title on tile only",
				"hover": "Show title on tooltip hover only",
				"hidden": "Don't show at all"
			}
		},
		"positionAppName": {
			"label": "App Name Position",
			"description": "Position of the app's name relative to the icon.",
			"dropdown": {
				"top": "Top",
				"right": "Right",
				"bottom": "Bottom",
				"left": "Left"
			}
		},
		"lineClampAppName": {
			"label": "App Name Line Clamp",
			"description": "Defines on how many lines your title should fit at it's maximum. Set 0 for unlimited."
		}
	},
	"integration": {
		"type": {
			"label": "Integration configuration",
			"description": "The integration configuration that will be used to connect to your app.",
			"placeholder": "Select an integration",
			"defined": "Defined",
			"undefined": "Undefined",
			"public": "Public",
			"private": "Private",
			"explanationPrivate": "A private secret will be sent to the server only once. Once your browser has refreshed the page, it will never be sent again.",
			"explanationPublic": "A public secret will always be sent to the client and is accessible over the API. It should not contain any confidential values such as usernames, passwords, tokens, certificates and similar!"
		},
		"secrets": {
			"description": "To update a secret, enter a value and click the save button. To remove a secret, use the clear button.",
			"warning": "Your credentials act as the access for your integrations and you should <strong>never</strong> share them with anybody else. The Homarr team will never ask for credentials. Make sure to <strong>store and manage your secrets safely</strong>.",
			"clear": "Clear secret",
			"save": "Save secret",
			"update": "Update secret"
		}
	},
	"validation": {
		"popover": "Your form contains invalid data. Hence, it can't be saved. Please resolve all issues and click this button again to save your changes",
		"name": "Name is required",
		"noUrl": "Url is required",
		"invalidUrl": "Value is not a valid url",
		"noIconUrl": "This field is required",
		"noExternalUri": "External URI is required",
		"invalidExternalUri": "External URI is not a valid uri"
	}
}
