{
	"tabs": {
		"general": "Geral",
		"behaviour": "Comportamento",
		"network": "Rede",
		"appearance": "Aparência",
		"integration": "Integração"
	},
	"general": {
		"appname": {
			"label": "Nome do aplicativo",
			"description": "Utilizado para exibir a aplicação no painel de instrumentos."
		},
		"internalAddress": {
			"label": "Endereço interno",
			"description": "Endereço interno de IP da aplicação.",
			"troubleshoot": {
				"label": "Está tendo problemas?",
				"header": "Aqui está uma lista dos erros mais comuns e da solução de problemas:",
				"lines": {
					"nothingAfterPort": "Você não deve, na maioria dos casos, se não em todos, inserir nenhum caminho após a porta. (Mesmo o '/admin' para pihole ou '/web' para plex)",
					"protocolCheck": "Certifique-se sempre de que o URL seja precedido por http ou https e de que esteja usando o URL correto.",
					"preferIP": "Recomenda-se usar o ip direto da máquina ou do contêiner com o qual você está tentando se comunicar.",
					"enablePings": "Verifique se o IP está correto ativando os pings. Personalize o quadro -> Layout -> Ativar pings. Um pequeno balão vermelho ou verde aparecerá nos blocos do aplicativo e, ao passar o mouse sobre ele, você verá o código de resposta (um balão verde com o código 200 é esperado na maioria dos casos).",
					"wget": "Para garantir que o homarr possa se comunicar com os outros aplicativos, certifique-se de usar o wget/curl/ping no IP:porta do aplicativo.",
					"iframe": "Quando se trata de iframes, eles devem sempre usar o mesmo protocolo (http/s) que o Homarr.",
					"clearCache": "Algumas informações são registradas no cache, portanto, uma integração pode não funcionar a menos que você limpe o cache nas opções gerais do Homarr."
				},
				"footer": "Para obter mais soluções de problemas, entre em contato pelo e-mail {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Endereço externo",
			"description": "URL que será aberto ao clicar na aplicação.",
			"tooltip": ""
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Abrir em novo separador",
			"description": "Abrir a aplicação num novo separador em vez do actual."
		},
		"tooltipDescription": {
			"label": "Descrição do aplicativo",
			"description": "O texto que você inserir aparecerá ao passar o mouse sobre o aplicativo.\r\nUse-o para fornecer aos usuários mais detalhes sobre seu aplicativo ou deixe-o vazio para não ter nada."
		},
		"customProtocolWarning": "Usar um protocolo não padrão. Isso pode exigir aplicativos pré-instalados e pode introduzir riscos à segurança. Certifique-se de que seu endereço seja seguro e confiável."
	},
	"network": {
		"statusChecker": {
			"label": "Verificador de estado",
			"description": "Verifica se a sua aplicação está online usando um simples pedido HTTP(S)."
		},
		"statusCodes": {
			"label": "Códigos de estado HTTP",
			"description": "Os códigos de status HTTP que são considerados como online."
		}
	},
	"appearance": {
		"icon": {
			"label": "Ícone de aplicação",
			"description": "Comece a digitar para encontrar um ícone. Você também pode colar o URL de uma imagem para usar um ícone personalizado.",
			"autocomplete": {
				"title": "Nenhum resultado encontrado",
				"text": "Tente usar um termo de pesquisa mais específico. Se não conseguir encontrar o ícone desejado, cole a URL da imagem acima para obter um ícone personalizado"
			},
			"noItems": {
				"title": "Carregando ícones externos",
				"text": "Isto pode levar alguns segundos"
			}
		},
		"appNameFontSize": {
			"label": "Tamanho da fonte do nome do aplicativo",
			"description": "Defina o tamanho da fonte para quando o nome do aplicativo for mostrado no bloco."
		},
		"appNameStatus": {
			"label": "Nome do aplicativo Status",
			"description": "Escolha onde você deseja que o título seja exibido, se for o caso.",
			"dropdown": {
				"normal": "Mostrar título somente no bloco",
				"hover": "Mostrar título somente ao passar o mouse sobre a dica de ferramenta",
				"hidden": "Não mostrar nada"
			}
		},
		"positionAppName": {
			"label": "Nome do aplicativo Posição",
			"description": "Posição do nome do aplicativo em relação ao ícone.",
			"dropdown": {
				"top": "Topo",
				"right": "Certo",
				"bottom": "Parte inferior",
				"left": "Esquerda"
			}
		},
		"lineClampAppName": {
			"label": "Nome do aplicativo Grampo de linha",
			"description": "Define em quantas linhas seu título deve caber, no máximo. Defina 0 para ilimitado."
		}
	},
	"integration": {
		"type": {
			"label": "Configuração de integração",
			"description": "A configuração de integração que será utilizada para se ligar à sua aplicação.",
			"placeholder": "Seleccione uma integração",
			"defined": "Definido",
			"undefined": "Indefinido",
			"public": "Público",
			"private": "Particular",
			"explanationPrivate": "Um segredo privado será enviado para o servidor apenas uma vez. Uma vez que o seu browser tenha actualizado a página, ela nunca mais será enviada.",
			"explanationPublic": "Um segredo público será sempre enviado para o cliente e é acessível através do API. Não deverá conter quaisquer valores confidenciais tais como nomes de utilizador, palavras-passe, fichas, certificados e similares!"
		},
		"secrets": {
			"description": "Para actualizar um segredo, introduza um valor e clique no botão de guardar. Para remover um segredo, utilizar o botão limpar.",
			"warning": "As suas credenciais funcionam como o acesso para as suas integrações e deverá <strong>nunca</strong> partilhá-las com mais ninguém. A equipa Homarr nunca irá pedir credenciais. Assegure-se de que <strong>guarda e gere os seus segredos em segurança</strong>.",
			"clear": "Segredo claro",
			"save": "Guardar segredo",
			"update": "Actualizar segredo"
		}
	},
	"validation": {
		"popover": "O seu formulário contém dados inválidos. Por conseguinte, não pode ser guardado. Por favor resolva todos os problemas e clique novamente neste botão para guardar as suas alterações.",
		"name": "O nome é obrigatório",
		"noUrl": "O URL é obrigatório",
		"invalidUrl": "O valor não é uma url válida",
		"noIconUrl": "Este campo é obrigatório",
		"noExternalUri": "É necessário um URI externo",
		"invalidExternalUri": "O URI externo não é um URI válido"
	}
}
