{
	"tabs": {
		"general": "General",
		"behaviour": "Comportamiento",
		"network": "Red",
		"appearance": "Apariencia",
		"integration": "Integración"
	},
	"general": {
		"appname": {
			"label": "Nombre de la aplicación",
			"description": "Se utiliza para mostrar la aplicación en el panel."
		},
		"internalAddress": {
			"label": "Dirección interna",
			"description": "Dirección IP interna de la aplicación.",
			"troubleshoot": {
				"label": "¿Tienes problemas?",
				"header": "Aquí hay una lista de errores comunes y solución de problemas:",
				"lines": {
					"nothingAfterPort": "En la mayoría de los casos, si no en todos, no debes ingresar ninguna ruta después del puerto. (Incluso '/admin' para pihole o '/web' para plex)",
					"protocolCheck": "Asegúrate siempre de que la URL esté precedida por http o https, y de estar utilizando la correcta.",
					"preferIP": "Se recomienda utilizar la ip directa de la máquina o contenedor con el que intentas comunicar.",
					"enablePings": "Comprueba que la IP es correcta habilitando los pings. Personalizar tablero -> Diseño -> Habilitar pings. Aparecerá una pequeña burbuja roja o verde en los mosaicos de su aplicación y, al pasar sobre ella, obtendrá su código de respuesta (en la mayoría de los casos se espera una burbuja verde con el código 200).",
					"wget": "Para asegurarte de que Homarr pueda comunicarse con las otras aplicaciones, asegúrate de hacer wget/curl/ping a la 'ip:puerto' de la aplicación.",
					"iframe": "Cuando se trata de iframes, siempre deben usar el mismo protocolo (http/s) que Homarr.",
					"clearCache": "Algunos datos se registran en caché, por lo que es posible que una integración no funcione a menos que borres la caché en las opciones generales de Homarr."
				},
				"footer": "Para obtener más información sobre la solución de problemas, ponte en contacto con nosotros en {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Dirección externa",
			"description": "URL que se abrirá al hacer clic en la aplicación.",
			"tooltip": "Puedes usar algunas variables para crear direcciones dinámicas:<br><br><b>[homarr_base]</b> : dirección completa excluyendo puerto y ruta. <i>(Ejemplo: 'https://subdominio.homarr.dev')</i><br><b>[homarr_hostname]</b> : url base completa incluyendo su subdominio actual. <i>(Ejemplo: 'subdominio.homarr.dev')</i><br><b>[homarr_domain]</b> : dominio con el subdominio filtrado. <i>(Ejemplo: 'homarr.dev')</i><br><b>[homarr_protocol]</b> : <i>http/https</i><br><br>Todas estas variables dependen de la url actual."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Abrir en una pestaña nueva",
			"description": "Abre la aplicación en una nueva pestaña en lugar de la actual."
		},
		"tooltipDescription": {
			"label": "Descripción de la aplicación",
			"description": "El texto que ingresas aparecerá cuando pases el cursor sobre tu aplicación.\nUsa esto para dar a los usuarios más detalles sobre tu aplicación o déjalo en blanco para no tener nada."
		},
		"customProtocolWarning": "Usando un protocolo no estándar. Esto puede requerir aplicaciones preinstaladas y puede presentar riesgos de seguridad. Asegúrese de que su dirección sea segura y confiable."
	},
	"network": {
		"statusChecker": {
			"label": "Comprobador de estado",
			"description": "Comprueba si tu aplicación está en línea mediante una simple solicitud HTTP(S)."
		},
		"statusCodes": {
			"label": "Códigos de estado HTTP",
			"description": "Códigos de estado HTTP que son considerados como en línea."
		}
	},
	"appearance": {
		"icon": {
			"label": "Icono de la aplicación",
			"description": "Empieza a escribir para encontrar un icono. También puedes pegar la URL de una imagen para usar un ícono personalizado.",
			"autocomplete": {
				"title": "No se han encontrado resultados",
				"text": "Intenta usar un término de búsqueda más específico. Si no puede encontrar el ícono deseado, pega la URL de la imagen arriba para obtener un ícono personalizado"
			},
			"noItems": {
				"title": "Cargando iconos externos",
				"text": "Esto puede tardar unos pocos segundos"
			}
		},
		"appNameFontSize": {
			"label": "Tamaño de fuente del nombre de la aplicación ",
			"description": "Establece el tamaño de fuente para cuando el nombre de la aplicación se muestre en el mosaico."
		},
		"appNameStatus": {
			"label": "Estado del nombre de la aplicación",
			"description": "Elige dónde deseas que aparezca el título, si es que lo hace.",
			"dropdown": {
				"normal": "Mostrar el título en el mosaico",
				"hover": "Mostrar el título en un globo, solo al pasar el cursor por encima",
				"hidden": "No mostrar"
			}
		},
		"positionAppName": {
			"label": "Posición del nombre de la aplicación",
			"description": "Posición del nombre de la aplicación en relación con el icono.",
			"dropdown": {
				"top": "Superior",
				"right": "Derecha",
				"bottom": "Inferior",
				"left": "Izquierda"
			}
		},
		"lineClampAppName": {
			"label": "Límite de línea del nombre de la aplicación",
			"description": "Define en cuántas líneas debe caber tu título como máximo. Establece 0 para ilimitado."
		}
	},
	"integration": {
		"type": {
			"label": "Configuración de la integración",
			"description": "Configuración de la integración que se usará para conectarse a su aplicación.",
			"placeholder": "Selecciona una integración",
			"defined": "Definida",
			"undefined": "Sin definir",
			"public": "Pública",
			"private": "Privada",
			"explanationPrivate": "Una clave privada será enviada al servidor solo una vez. Una vez que su navegador haya actualizado la página, nunca se volverá a enviar.",
			"explanationPublic": "Una clave pública siempre será enviada al cliente y se podrá acceder a él a través de la API. ¡No debe contener información confidencial como nombres de usuario, contraseñas, tokens, certificados y similares!"
		},
		"secrets": {
			"description": "Para actualizar una clave, ingresa un valor y haz clic en el botón Guardar. Para eliminar una clave, utiliza el botón limpiar.",
			"warning": "Tus credenciales actúan como acceso para tus integraciones y <strong>nunca</strong> debes compartirlas con nadie. El equipo de Homarr nunca te preguntará por tus credenciales. Asegúrate de <strong>almacenar y administrar tus claves de forma segura</strong>.",
			"clear": "Limpiar clave",
			"save": "Guardar clave",
			"update": "Actualizar clave"
		}
	},
	"validation": {
		"popover": "Tu formulario contiene datos no válidos. Por lo tanto, no se puede guardar. Por favor, resuelve todos los problemas y vuelve a hacer clic en este botón para guardar los cambios",
		"name": "El nombre es obligatorio",
		"noUrl": "La URL es obligatoria",
		"invalidUrl": "El valor no es una URL válida",
		"noIconUrl": "Este campo es obligatorio",
		"noExternalUri": "La URI externa es obligatoria",
		"invalidExternalUri": "El valor no es una URI válida"
	}
}
