{
	"tabs": {
		"general": "General",
		"behaviour": "Comportamiento",
		"network": "Red",
		"appearance": "Apariencia",
		"integration": "Integración"
	},
	"general": {
		"appname": {
			"label": "Nombre de la app",
			"description": "Usado para mostrar la app en el dashboard."
		},
		"internalAddress": {
			"label": "Dirección interna",
			"description": "Dirección IP interna de la app."
		},
		"externalAddress": {
			"label": "Dirección externa",
			"description": "URL que se abrirá al hacer clic en la app."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Abrir en nueva pestaña",
			"description": "Abrir la app en una nueva pestaña, en vez de en la actual."
		}
	},
	"network": {
		"statusChecker": {
			"label": "Verificador de estado",
			"description": "Comprueba si tu app está en línea usando una simple petición HTTP(S)."
		},
		"statusCodes": {
			"label": "Códigos HTTP de estado",
			"description": "Códigos de estado HTTP considerados como en línea."
		}
	},
	"appearance": {
		"icon": {
			"label": "Icono App",
			"description": "Empieza escribiendo para encontrar un icono. También puedes pegar la URL de una imagen para usar un icono personalizado.",
			"autocomplete": {
				"title": "Ningún resultado encontrado",
				"text": "Intenta usar un término de búsqueda más específico. Si no puedes encontrar tu icono deseado, pega la URL de la imagen encima para establecer un icono personalizado"
			},
			"noItems": {
				"title": "Cargando iconos externos",
				"text": "Esto puede tomar unos segundos"
			}
		}
	},
	"integration": {
		"type": {
			"label": "Configuración de integración",
			"description": "Configuración de la integración que se será usada por tu app.",
			"placeholder": "Seleccionar una integración",
			"defined": "Definido",
			"undefined": "Sin definir",
			"public": "Público",
			"private": "Privado",
			"explanationPrivate": "Una clave privada será enviada al servidor solo una vez. Una vez el navegador refresca la página, ésta no será enviada otra vez.",
			"explanationPublic": "Una clave pública siempre será enviada al cliente, y se podrá acceder a él a través de la API. Ésta no debe contener información confidencial, como: nombres de usuario, contraseñas, tokens, certificados y similares!"
		},
		"secrets": {
			"description": "Para actualizar una clave, introducir un valor y pulsar el botón guardar. Para eliminar una clave, usa el botón limpiar.",
			"warning": "Tus credenciales actúan como acceso para tus integraciones y <strong>nunca</strong> debes compartirlas con nadie. El equipo de Homarr nunca te preguntará sobre éstas. Asegúrate de <strong>almacenar y administrar tus claves de manera segura</strong>.",
			"clear": "Limpiar clave",
			"save": "Guardar clave",
			"update": "Actualizar clave"
		}
	},
	"validation": {
		"popover": "Tu formulario contiene datos no válidos. Por lo tanto, no pude ser guardado. Por favor, resuelve los problemas, y presiona este botón, otra vez, para guardar cambios"
	}
}
