{
	"tabs": {
		"general": "Общие",
		"behaviour": "Поведение",
		"network": "Сеть",
		"appearance": "Внешний вид",
		"integration": "Интеграция"
	},
	"general": {
		"appname": {
			"label": "Название приложения",
			"description": "Используется для отображения приложения на панели."
		},
		"internalAddress": {
			"label": "Внутренний адрес",
			"description": "Внутренний IP-адрес приложения.",
			"troubleshoot": {
				"label": "Возникли проблемы?",
				"header": "Ниже приведен список часто встречающихся ошибок и способы их устранения:",
				"lines": {
					"nothingAfterPort": "В большинстве, если не во всех случаях, не следует вводить какой-либо путь после порта. (Даже '/admin' для pihole или '/web' для plex)",
					"protocolCheck": "Убедитесь, что URL начинается с http или https и что вы используете правильный протокол.",
					"preferIP": "Рекомендуется использовать прямой IP-адрес машины или контейнера, с которым вы хотите взаимодействовать.",
					"enablePings": "Проверьте правильность IP, включив функцию пинга. Настройка панели -> Макет -> Включить пинг. На плитке вашего приложения появится маленький красный или зеленый кружок, наведя на который вы увидите код ответа (в большинстве случаев ожидается зеленый кружок с кодом 200).",
					"wget": "Чтобы убедиться, что Homarr может взаимодействовать с другими приложениями, обязательно выполните команды wget/curl/ping с IP-адресом и портом приложения.",
					"iframe": "Что касается iframes, то они всегда должны использовать тот же протокол (http/s), что и Homarr.",
					"clearCache": "Некоторые данные сохраняются в кэше, поэтому интеграция может не работать, если вы не очистили кэш в общих настройках Homarr."
				},
				"footer": "По вопросам решения проблем обращайтесь в наш {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Внешний адрес",
			"description": "URL-адрес, который будет открыт при нажатии на приложение."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Открыть в новой вкладке",
			"description": "Открывать приложение в новой вкладке вместо текущей."
		},
		"tooltipDescription": {
			"label": "Описание приложения",
			"description": "Введенный вами текст появится при наведении курсора на ваше приложение.\nЗдесь вы можете дать пользователям больше информации о вашем приложении или оставить поле пустым."
		},
		"customProtocolWarning": "Используется нестандартный протокол. Это может потребовать установки дополнительных приложений и представлять угрозу для безопасности. Убедитесь, что ваш адрес надежен и является доверенным."
	},
	"network": {
		"statusChecker": {
			"label": "Проверка статуса",
			"description": "Проверяет, включено ли ваше приложение, используя простой HTTP(S) запрос."
		},
		"statusCodes": {
			"label": "HTTP статусные коды",
			"description": "HTTP статусные коды, которые считаются включенными."
		}
	},
	"appearance": {
		"icon": {
			"label": "Иконка приложения",
			"description": "Начните вводить текст, чтобы найти иконку. Вы также можете вставить URL-адрес изображения, чтобы использовать собственную иконку.",
			"autocomplete": {
				"title": "Результаты не найдены",
				"text": "Попробуйте использовать более конкретное условие поиска. Если вы не можете найти нужную иконку, вставьте URL-адрес изображения выше для пользовательской иконки"
			},
			"noItems": {
				"title": "Загрузка внешних иконок",
				"text": "Это может занять несколько секунд"
			}
		},
		"appNameFontSize": {
			"label": "Размер шрифта названия приложения",
			"description": "Установить размер шрифта отображаемого на плитке названия приложения."
		},
		"appNameStatus": {
			"label": "Статус названия приложения",
			"description": "Выберите, где будет отображаться заголовок, если он вообще будет отображаться.",
			"dropdown": {
				"normal": "Показать заголовок только на плитке",
				"hover": "Показать заголовок только при наведении курсора",
				"hidden": "Вообще не показывать"
			}
		},
		"positionAppName": {
			"label": "Положение названия приложения",
			"description": "Положение названия приложения относительно иконки.",
			"dropdown": {
				"top": "Сверху",
				"right": "Справа",
				"bottom": "Снизу",
				"left": "Слева"
			}
		},
		"lineClampAppName": {
			"label": "Максимальное количество строк для названия приложения",
			"description": "Определяет, на скольких строках максимально должно поместиться ваше название. Установите 0 для неограниченного количества строк."
		}
	},
	"integration": {
		"type": {
			"label": "Настройка интеграции",
			"description": "Настройка интеграции, которая будет использоваться для подключения к вашему приложению.",
			"placeholder": "Выбрать интеграцию",
			"defined": "Определено",
			"undefined": "Не определено",
			"public": "Публичный",
			"private": "Приватный",
			"explanationPrivate": "Приватный секрет будет отправлен на сервер только один раз. После обновления страницы он никогда не будет отправлен снова.",
			"explanationPublic": "Публичный секрет всегда передается клиенту и доступен через API. Он не должен содержать никаких конфиденциальных значений, таких как имена пользователей, пароли, токены, сертификаты и тому подобное!"
		},
		"secrets": {
			"description": "Чтобы обновить секрет, введите значение и нажмите кнопку \"Сохранить\". Чтобы удалить секрет, воспользуйтесь кнопкой \"Очистить секрет\".",
			"warning": "Ваши учетные данные служат доступом к вашей интеграции, и вы <strong>никогда</strong> не должны передавать их кому-либо еще. Команда Homarr никогда не запрашивает учетные данные. Убедитесь, что <strong>храните и безопасно управляйте вашими секретами</strong>.",
			"clear": "Очистить секрет",
			"save": "Сохранить секрет",
			"update": "Обновить секрет"
		}
	},
	"validation": {
		"popover": "Ваша форма содержит недопустимые данные. Следовательно, она не может быть сохранена. Пожалуйста, устраните все проблемы и нажмите на эту кнопку еще раз, чтобы сохранить изменения",
		"name": "Имя обязательно",
		"noUrl": "Url обязателен",
		"invalidUrl": "Значение не является допустимым url",
		"noIconUrl": "Это поле обязательно",
		"noExternalUri": "Требуется внешний URI",
		"invalidExternalUri": "Внешний URI не является допустимым"
	}
}
