{
	"tabs": {
		"general": "Общие",
		"behaviour": "Поведение",
		"network": "Сеть",
		"appearance": "Внешний вид",
		"integration": "Интеграция"
	},
	"general": {
		"appname": {
			"label": "Название приложения",
			"description": "Используется для отображения приложения на панели."
		},
		"internalAddress": {
			"label": "Внутренний адрес",
			"description": "Внутренний IP-адрес приложения."
		},
		"externalAddress": {
			"label": "Внешний адрес",
			"description": "URL-адрес, который будет открыт при нажатии на приложение."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Открыть в новой вкладке",
			"description": "Открывать приложение в новой вкладке вместо текущей."
		},
		"customProtocolWarning": "Использование нестандартного протокола. Для этого могут потребоваться предустановленные приложения, что может создать угрозу безопасности. Убедитесь, что ваш адрес безопасен и заслуживает доверия."
	},
	"network": {
		"statusChecker": {
			"label": "Проверка состояния",
			"description": "Проверяет, находится ли ваше приложение в сети, используя простой запрос HTTP(S)."
		},
		"statusCodes": {
			"label": "Коды состояния HTTP",
			"description": "Коды состояния HTTP, которые считаются онлайн."
		}
	},
	"appearance": {
		"icon": {
			"label": "Иконка приложения",
			"description": "Начните вводить текст, чтобы найти иконку. Вы также можете вставить URL-адрес изображения, чтобы использовать собственную иконку.",
			"autocomplete": {
				"title": "Результаты не найдены",
				"text": "Попробуйте использовать более конкретное условие поиска. Если вы не можете найти нужную иконку, вставьте URL-адрес изображения выше для пользовательской иконки"
			},
			"noItems": {
				"title": "Загрузка внешних иконок",
				"text": "Это может занять несколько секунд"
			}
		}
	},
	"integration": {
		"type": {
			"label": "Настройка интеграции",
			"description": "Настройка интеграции, которая будет использоваться для подключения к вашему приложению.",
			"placeholder": "Выбрать интеграцию",
			"defined": "Определено",
			"undefined": "Не определено",
			"public": "Публичный",
			"private": "Приватный",
			"explanationPrivate": "Приватный секрет будет отправлен на сервер только один раз. После обновления страницы он никогда не будет отправлен снова.",
			"explanationPublic": "Публичный секрет всегда передается клиенту и доступен через API. Он не должен содержать никаких конфиденциальных значений, таких как имена пользователей, пароли, токены, сертификаты и тому подобное!"
		},
		"secrets": {
			"description": "Чтобы обновить секрет, введите значение и нажмите кнопку \"Сохранить\". Чтобы удалить секрет, воспользуйтесь кнопкой \"Очистить секрет\".",
			"warning": "Ваши учетные данные служат доступом к вашей интеграции, и вы <strong>никогда</strong> не должны передавать их кому-либо еще. Команда Homarr никогда не запрашивает учетные данные. Убедитесь, что <strong>храните и безопасно управляйте вашими секретами</strong>.",
			"clear": "Очистить секрет",
			"save": "Сохранить секрет",
			"update": "Обновить секрет"
		}
	},
	"validation": {
		"popover": "Ваша форма содержит недопустимые данные. Следовательно, она не может быть сохранена. Пожалуйста, устраните все проблемы и нажмите на эту кнопку еще раз, чтобы сохранить изменения"
	}
}
