{
	"tabs": {
		"general": "Općenito",
		"behaviour": "Ponašanje",
		"network": "Mreža",
		"appearance": "Izgled",
		"integration": "Integracija"
	},
	"general": {
		"appname": {
			"label": "Naziv aplikacije",
			"description": "Koristi se za prikazivanje aplikacije na nadzornoj ploči."
		},
		"internalAddress": {
			"label": "Interna adresa",
			"description": "Interna IP-adresa aplikacije.",
			"troubleshoot": {
				"label": "Imate problema?",
				"header": "Evo popisa najčešćih pogrešaka i rješavanja problema:",
				"lines": {
					"nothingAfterPort": "U većini, ako ne iu svim slučajevima, ne biste trebali unositi nikakav put nakon porta. (Čak i '/admin' za pihole ili '/web' za plex)",
					"protocolCheck": "Uvijek provjerite ima li ispred URL-a http ili https i provjerite koristite li pravi.",
					"preferIP": "Preporuča se korištenje izravnog IP-a stroja ili spremnika s kojim pokušavate komunicirati.",
					"enablePings": "Provjerite je li IP ispravan omogućavanjem pingova. Prilagodite ploču -> Izgled -> Omogući pingove. Na pločicama vaše aplikacije pojavit će se mali crveni ili zeleni mjehurić, a lebdeći iznad njega dat ćete njezin kod odgovora (u većini slučajeva očekuje se zeleni mjehurić s kodom 200).",
					"wget": "Kako biste bili sigurni da homarr može komunicirati s drugim aplikacijama, provjerite wget/curl/ping IP:port aplikacije.",
					"iframe": "Kada su u pitanju iframeovi, oni bi uvijek trebali koristiti isti protokol (http/s) kao Homarr.",
					"clearCache": "Neke su informacije registrirane u predmemoriji, tako da integracija možda neće raditi osim ako ne izbrišete predmemoriju u općim opcijama Homarra."
				},
				"footer": "Za dodatna rješenja problema obratite se na našu {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Vanjska adresa",
			"description": "URL koji će se otvoriti prilikom klika na aplikaciju.",
			"tooltip": ""
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Otvori u novoj kartici",
			"description": "Otvori aplikaciju u novoj kartici umjesto u trenutnoj."
		},
		"tooltipDescription": {
			"label": "Opis aplikacije",
			"description": "Tekst koji unesete pojavit će se kada zadržite pokazivač iznad vaše aplikacije.\r\nKoristite ovo da biste korisnicima dali više pojedinosti o svojoj aplikaciji ili ostavite prazno da nemate ništa."
		},
		"customProtocolWarning": "Korištenje nestandardnog protokola. To može zahtijevati unaprijed instalirane aplikacije i predstavljati sigurnosne rizike. Provjerite je li vaša adresa sigurna i pouzdana."
	},
	"network": {
		"statusChecker": {
			"label": "Provjeritelj statusa",
			"description": "Provjerava je li vaša aplikacija online pomoću jednostavnog HTTP(S) zahtjeva."
		},
		"statusCodes": {
			"label": "HTTP statusni kodovi",
			"description": "HTTP statusni kodovi koji se smatraju kao online."
		}
	},
	"appearance": {
		"icon": {
			"label": "Ikona Aplikacije",
			"description": "Počnite tipkati kako biste pronašli ikonu. Također možete zalijepiti URL slike kako biste koristili prilagođenu ikonu.",
			"autocomplete": {
				"title": "Nije pronađen nijedan rezultat",
				"text": "Pokušajte koristiti precizniji pojam za pretraživanje kako biste pronašli željenu ikonu. Ako je ne možete pronaći, možete zalijepiti URL slike iznad kako biste koristili prilagođenu ikonu"
			},
			"noItems": {
				"title": "Učitavanje vanjskih ikona",
				"text": "Ovo može potrajati nekoliko sekundi"
			}
		},
		"appNameFontSize": {
			"label": "Veličina fonta naziva aplikacije",
			"description": "Postavite veličinu fonta kada se naziv aplikacije prikazuje na pločici."
		},
		"appNameStatus": {
			"label": "Status naziva aplikacije",
			"description": "Odaberite gdje želite da se naslov pojavi, ako uopće.",
			"dropdown": {
				"normal": "Prikaži naslov samo na pločici",
				"hover": "Prikaz naslova samo na opisu alata",
				"hidden": "Ne pokazuj uopće"
			}
		},
		"positionAppName": {
			"label": "Pozicija naziva aplikacije",
			"description": "Položaj naziva aplikacije u odnosu na ikonu.",
			"dropdown": {
				"top": "Vrh",
				"right": "Pravo",
				"bottom": "Dno",
				"left": "Lijevo"
			}
		},
		"lineClampAppName": {
			"label": "Naziv aplikacije Line Clamp",
			"description": "Definira koliko redaka vaš naslov treba maksimalno stati. Postavite 0 za neograničeno."
		}
	},
	"integration": {
		"type": {
			"label": "Konfiguracija integracije",
			"description": "Konfiguracija integracije koja će se koristiti za povezivanje s vašom aplikacijom.",
			"placeholder": "Odaberite integraciju",
			"defined": "Definirano",
			"undefined": "Nedefinirano",
			"public": "Javno",
			"private": "Privatno",
			"explanationPrivate": "Privatna tajna će biti poslana serveru samo jednom. Nakon što se vaš preglednik osvježi, više je neće poslati.",
			"explanationPublic": "Javna tajna će uvijek biti poslana klijentu i dostupna putem API-ja. Ne bi trebala sadržavati povjerljive vrijednosti poput korisničkih imena, lozinki, tokena, certifikata i slično!"
		},
		"secrets": {
			"description": "Za ažuriranje tajne, unesite vrijednost i kliknite gumb za spremanje. Za uklanjanje tajne, koristite gumb za brisanje.",
			"warning": "Vaši pristupni podaci služe kao pristup za vaše integracije i <strong>nikada</strong> ih ne biste trebali dijeliti s drugima. Tim Homarr tim nikada neće tražiti pristupne podatke. Pazite da <strong>sigurno pohranjujete i upravljate svojim tajnama</strong>.",
			"clear": "Brisanje tajni",
			"save": "Spasi tajnu",
			"update": "Ažuriraj tajnu"
		}
	},
	"validation": {
		"popover": "Vaš obrazac sadrži neispravne podatke. Stoga se ne može spremiti. Molimo riješite sve probleme i ponovno kliknite ovaj gumb da biste spremili promjene",
		"name": "Ime je potrebno",
		"noUrl": "Url je obavezan",
		"invalidUrl": "Vrijednost nije važeći url",
		"noIconUrl": "ovo polje je obavezno",
		"noExternalUri": "Potreban je vanjski URI",
		"invalidExternalUri": "Vanjski URI nije važeći URI"
	}
}
