{
	"tabs": {
		"general": "Všeobecné",
		"behaviour": "Správanie",
		"network": "Sieť",
		"appearance": "Vzhľad",
		"integration": "Integrácia"
	},
	"general": {
		"appname": {
			"label": "Názov aplikácie",
			"description": "Používa sa na zobrazenie aplikácie na palubnej doske."
		},
		"internalAddress": {
			"label": "Interná adresa",
			"description": "Interná IP adresa aplikácie.",
			"troubleshoot": {
				"label": "Máte problémy?",
				"header": "Tu je zoznam bežných chýb a riešení problémov:",
				"lines": {
					"nothingAfterPort": "Vo väčšine, ak nie vo všetkých prípadoch, by ste za portom nemali zadávať žiadnu cestu. (Dokonca aj '/admin' pre pihole alebo '/web' pre plex)",
					"protocolCheck": "Vždy sa uistite, že pred adresou URL je http alebo https, a uistite sa, že používate tú správnu.",
					"preferIP": "Odporúča sa použiť priamu adresu IP zariadenia alebo kontajnera, s ktorým sa pokúšate komunikovať.",
					"enablePings": "Skontrolujte, či je IP správna, povolením pingov. Prispôsobiť tabuľu -> Rozloženie -> Povoliť pingy. Na dlaždiciach vašej aplikácie sa objaví malá červená alebo zelená bublina a po jej umiestnení získate kód odpovede (vo väčšine prípadov sa očakáva zelená bublina s kódom 200).",
					"wget": "Aby ste sa uistili, že homarr môže komunikovať s ostatnými aplikáciami, uistite sa, že ste zadali wget/curl/ping na IP:port aplikácie.",
					"iframe": "Pokiaľ ide o prvky iframe, mali by vždy používať rovnaký protokol (http/s) ako Homarr.",
					"clearCache": "Niektoré informácie sú registrované vo vyrovnávacej pamäti, takže integrácia nemusí fungovať, pokiaľ nevymažete vyrovnávaciu pamäť vo všeobecných možnostiach Homarra."
				},
				"footer": "Ak potrebujete ďalšie riešenie problémov, obráťte sa na našu {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Externá adresa",
			"description": "URL, ktorá sa otvorí po kliknutí na aplikáciu.",
			"tooltip": "Na vytvorenie dynamických adries môžete použiť niekoľko premenných:<br><br><b>[homarr_base]</b>: úplná adresa bez portu a cesty. <i>(Príklad: 'https://subdomain.homarr.dev')</i><br><b>[homarr_hostname]</b>: úplná základná url adresa vrátane jej aktuálnej subdomény. <i>(Príklad: 'subdomena.homarr.dev')</i><br><b>[homarr_domena]</b>: doména s odfiltrovanou subdoménou. <i>(Príklad: `homarr.dev'</i>)<br><b>[homarr_protocol]</b>: <i>http/https</i><br><br>Všetky tieto premenné závisia od aktuálnej url."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Otvoriť na novej karte",
			"description": "Otvorenie aplikácie na novej karte namiesto aktuálnej."
		},
		"tooltipDescription": {
			"label": "Popis aplikácie",
			"description": "Text, ktorý zadáte, sa zobrazí po nabehnutí na aplikáciu.\nPomocou neho môžete používateľom poskytnúť viac informácií o vašej aplikácii alebo ho môžete nechať prázdny, ak nechcete mať nič."
		},
		"customProtocolWarning": "Používanie neštandardného protokolu. Môže to vyžadovať predinštalované aplikácie a môže to predstavovať bezpečnostné riziká. Uistite sa, že vaša adresa je bezpečná a dôveryhodná."
	},
	"network": {
		"statusChecker": {
			"label": "Kontrola stavu",
			"description": "Pomocou jednoduchej požiadavky HTTP skontroluje, či je vaša aplikácia online."
		},
		"statusCodes": {
			"label": "Stavové kódy HTTP",
			"description": "Stavové kódy HTTP, ktoré sa považujú za online."
		}
	},
	"appearance": {
		"icon": {
			"label": "Ikona aplikácie",
			"description": "Začnite písať a vyhľadajte ikonu. Ak chcete použiť vlastnú ikonu, môžete vložiť aj adresu URL obrázka.",
			"autocomplete": {
				"title": "Nenašli sa žiadne výsledky",
				"text": "Skúste použiť konkrétnejší vyhľadávací výraz. Ak nemôžete nájsť požadovanú ikonu, vložte vyššie uvedenú adresu URL obrázka pre vlastnú ikonu"
			},
			"noItems": {
				"title": "Načítanie externých ikon",
				"text": "Môže to trvať niekoľko sekúnd"
			}
		},
		"appNameFontSize": {
			"label": "Názov aplikácie Veľkosť písma",
			"description": "Nastavenie veľkosti písma pre zobrazenie názvu aplikácie na dlaždici."
		},
		"appNameStatus": {
			"label": "Názov aplikácie Stav",
			"description": "Vyberte, kde sa má názov zobrazovať, ak vôbec.",
			"dropdown": {
				"normal": "Zobrazenie názvu iba na dlaždici",
				"hover": "Zobrazenie názvu len pri zobrazení nápovedy po nabehnutí na nástroj",
				"hidden": "Viac nezobrazovať"
			}
		},
		"positionAppName": {
			"label": "Názov aplikácie Pozícia",
			"description": "Poloha názvu aplikácie vzhľadom na ikonu.",
			"dropdown": {
				"top": "Hore",
				"right": "Vpravo",
				"bottom": "Dole",
				"left": "Vľavo"
			}
		},
		"lineClampAppName": {
			"label": "Názov aplikácie Line Clamp",
			"description": "Určuje, na koľko riadkov sa má maximálne zmestiť váš nadpis. Nastavte 0 pre neobmedzený počet."
		}
	},
	"integration": {
		"type": {
			"label": "Konfigurácia integrácií",
			"description": "Konfigurácia integrácie, ktorá sa použije na pripojenie k vašej aplikácii.",
			"placeholder": "Výber integrácie",
			"defined": "Definované",
			"undefined": "Nedefinované",
			"public": "Verejné",
			"private": "Súkromné",
			"explanationPrivate": "Súkromné tajomstvo sa odošle na server iba raz. Po obnovení stránky prehliadačom sa už nikdy neodošle.",
			"explanationPublic": "Verejné tajomstvo sa vždy odošle klientovi a je prístupné cez API. Nemalo by obsahovať žiadne dôverné hodnoty, ako sú používateľské mená, heslá, tokeny, certifikáty a podobne!"
		},
		"secrets": {
			"description": "Ak chcete aktualizovať tajomstvo, zadajte hodnotu a kliknite na tlačidlo Uložiť. Ak chcete odstrániť tajomstvo, použite tlačidlo vymazať.",
			"warning": "Vaše poverovacie údaje slúžia ako prístupové údaje pre vaše integrácie a nikdy by ste ich nemali <strong></strong> zdieľať s nikým iným. Tím Homarr vás nikdy nebude žiadať o prístupové údaje. Dbajte na to, aby ste svoje <strong>tajné údaje bezpečne uchovávali a spravovali</strong>.",
			"clear": "Vymazať tajomstvo",
			"save": "Uložiť tajomstvo",
			"update": "Aktualizovať tajomstvo"
		}
	},
	"validation": {
		"popover": "Váš formulár obsahuje neplatné údaje. Preto ho nemožno uložiť. Vyriešte všetky problémy a znovu kliknite na toto tlačidlo, aby ste uložili svoje zmeny",
		"name": "Názov je povinný",
		"noUrl": "URL je povinná",
		"invalidUrl": "Hodnota nie je platná url",
		"noIconUrl": "Toto pole je povinné",
		"noExternalUri": "Vyžaduje sa externý URI",
		"invalidExternalUri": "Externý URI nie je platný uri"
	}
}
