{
	"tabs": {
		"general": "Ogólne",
		"behaviour": "Zachowanie",
		"network": "Sieć",
		"appearance": "Wygląd",
		"integration": "Integracja"
	},
	"general": {
		"appname": {
			"label": "Nazwa aplikacji",
			"description": "Służy do wyświetlania aplikacji na desce rozdzielczej."
		},
		"internalAddress": {
			"label": "Adres wewnętrzny",
			"description": "Wewnętrzny adres IP aplikacji.",
			"troubleshoot": {
				"label": "Masz problemy?",
				"header": "Oto lista najczęściej popełnianych błędów i sposobów ich rozwiązywania:",
				"lines": {
					"nothingAfterPort": "W większości, jeśli nie we wszystkich przypadkach, nie należy wprowadzać żadnej ścieżki po porcie. (Nawet '/admin' dla pihole lub '/web' dla plex)",
					"protocolCheck": "Zawsze upewnij się, że adres URL jest poprzedzony przez http lub https, i upewnij się, że używasz odpowiedniego adresu.",
					"preferIP": "Zalecane jest użycie bezpośredniego adresu IP maszyny lub kontenera, z którym próbujesz się komunikować.",
					"enablePings": "Sprawdź, czy adres IP jest prawidłowy, włączając polecenia ping. Dostosuj tablicę -> Układ -> Włącz pingi. Na kafelkach aplikacji pojawi się mała czerwona lub zielona dymka, a najechanie na nią spowoduje wyświetlenie kodu odpowiedzi (w większości przypadków oczekiwana jest zielona dymka z kodem 200).",
					"wget": "Aby mieć pewność, że homarr będzie mógł komunikować się z innymi aplikacjami, wykonaj wget/curl/ping IP:port aplikacji.",
					"iframe": "Jeśli chodzi o ramki iframe, powinny one zawsze używać tego samego protokołu (http/s), co Homarr.",
					"clearCache": "Niektóre informacje są rejestrowane w pamięci podręcznej, więc integracja może nie działać, jeśli nie wyczyścisz pamięci podręcznej w ogólnych opcjach Homarr."
				},
				"footer": "Aby uzyskać więcej informacji na temat rozwiązywania problemów, skontaktuj się z nami na naszym {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Adres zewnętrzny",
			"description": "URL, który zostanie otwarty po kliknięciu na aplikację.",
			"tooltip": ""
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Otwórz w nowej karcie",
			"description": "Otwórz aplikację w nowej karcie zamiast w bieżącej."
		},
		"tooltipDescription": {
			"label": "Opis aplikacji",
			"description": "Wprowadzony tekst pojawi się po najechaniu kursorem na aplikację.\nUżyj go, aby podać użytkownikom więcej szczegółów na temat aplikacji lub pozostaw pusty, aby nic nie wyświetlać."
		},
		"customProtocolWarning": "Wykorzystuje niestandardowy protokół. Może wymagać instalacji innych aplikacji i powodować zagrożenia bezpieczeństwa. Upewnij się, że podany adres jest bezpieczny i zaufany."
	},
	"network": {
		"statusChecker": {
			"label": "Kontroler stanu",
			"description": "Sprawdza czy Twoja aplikacja jest online używając prostego żądania HTTP(S)."
		},
		"statusCodes": {
			"label": "Kody statusu HTTP",
			"description": "Kody statusów HTTP, które są uznawane za internetowe."
		}
	},
	"appearance": {
		"icon": {
			"label": "Ikona aplikacji",
			"description": "Zacznij pisać, aby znaleźć ikonę. Możesz również wkleić adres URL obrazu, aby użyć ikony niestandardowej.",
			"autocomplete": {
				"title": "Nie znaleziono żadnych wyników",
				"text": "Spróbuj użyć bardziej konkretnego hasła wyszukiwania. Jeśli nie możesz znaleźć żądanej ikony, wklej adres URL obrazu powyżej, aby wyszukać niestandardową ikonę"
			},
			"noItems": {
				"title": "Ładowanie zewnętrznych ikon",
				"text": "To może zająć kilka sekund"
			}
		},
		"appNameFontSize": {
			"label": "Rozmiar czcionki nazwy aplikacji",
			"description": "Ustaw rozmiar czcionki, nazwy aplikacji wyświetlanej na kafelku."
		},
		"appNameStatus": {
			"label": "Status nazwy aplikacji",
			"description": "Wybierz czy i gdzie ma być wyświetlany tytuł aplikacji.",
			"dropdown": {
				"normal": "Pokaż tytuł tylko na kafelku",
				"hover": "Pokaż tytuł tylko po najechaniu na etykietę narzędzia",
				"hidden": "Nie pokazuj w ogóle"
			}
		},
		"positionAppName": {
			"label": "Pozycja nazwy aplikacji",
			"description": "Pozycja nazwy aplikacji względem ikony.",
			"dropdown": {
				"top": "Góra",
				"right": "Prawo",
				"bottom": "Dół",
				"left": "Lewo"
			}
		},
		"lineClampAppName": {
			"label": "Maksymalna ilość wierszy nazwy",
			"description": "Określa, w ilu liniach maksymalnie powinien zmieścić się tytuł. Ustaw 0 dla nieograniczonej liczby."
		}
	},
	"integration": {
		"type": {
			"label": "Konfiguracja integracji",
			"description": "Konfiguracja integracji, która zostanie użyta do połączenia z twoją aplikacją.",
			"placeholder": "Wybierz integrację",
			"defined": "Określone",
			"undefined": "Niezdefiniowane",
			"public": "Publiczna",
			"private": "Prywatny",
			"explanationPrivate": "Prywatny sekret zostanie wysłany do serwera tylko raz. Po odświeżeniu strony przez przeglądarkę, nie zostanie on już nigdy wysłany.",
			"explanationPublic": "Sekret publiczny będzie zawsze wysyłany do klienta i jest dostępny za pośrednictwem interfejsu API. Nie powinien zawierać żadnych poufnych wartości, takich jak nazwy użytkowników, hasła, tokeny, certyfikaty i podobne!"
		},
		"secrets": {
			"description": "Aby zaktualizować sekret, wprowadź wartość i kliknij przycisk Zapisz. Aby usunąć sekret, należy użyć przycisku wyczyść.",
			"warning": "Twoje dane uwierzytelniające działają jako dostęp do Twoich integracji i powinieneś <strong>nigdy</strong> dzielić się nimi z nikim innym. Zespół Homarr nigdy nie będzie prosił o dane uwierzytelniające. Upewnij się, że <strong>przechowujesz i zarządzasz swoimi sekretami bezpiecznie</strong>.",
			"clear": "Wyraźna tajemnica",
			"save": "Zachowaj tajemnicę",
			"update": "Tajemnica aktualizacji"
		}
	},
	"validation": {
		"popover": "Twój formularz zawiera nieprawidłowe dane. Dlatego nie można go zapisać. Proszę rozwiązać wszystkie problemy i kliknąć ten przycisk ponownie, aby zapisać zmiany.",
		"name": "Nazwa jest wymagana",
		"noUrl": "Adres URL jest wymagany",
		"invalidUrl": "Wartość nie jest poprawnym adresem URL",
		"noIconUrl": "To pole jest wymagane",
		"noExternalUri": "Zewnętrzny URI jest wymagany",
		"invalidExternalUri": "Zewnętrzny URI nie jest prawidłowym uri"
	}
}
