{
	"tabs": {
		"general": "Загальне",
		"behaviour": "Модель поведінки",
		"network": "Мережа",
		"appearance": "Вигляд",
		"integration": "Інтеграція"
	},
	"general": {
		"appname": {
			"label": "Назва застосунку",
			"description": "Використовується для зображення програми на головній сторінці."
		},
		"internalAddress": {
			"label": "Внутрішня адреса",
			"description": "Внутрішній IP додатку.",
			"troubleshoot": {
				"label": "Маєш проблеми?",
				"header": "Ось список найпоширеніших помилок і способів їх усунення:",
				"lines": {
					"nothingAfterPort": "У більшості, якщо не у всіх випадках, не слід вводити шлях після порту. (Навіть \"/admin\" для pihole або \"/web\" для plex).",
					"protocolCheck": "Завжди переконайтеся, що перед URL-адресою стоїть http або https, а також переконайтеся, що ви використовуєте правильний протокол.",
					"preferIP": "Рекомендується використовувати прямий ip машини або контейнера, з яким ви намагаєтеся зв'язатися.",
					"enablePings": "Перевірте правильність IP-адреси, увімкнувши пінг. Налаштуйте Board -> Макет -> Увімкнути пінги. На плитці вашого додатку з'явиться маленька червона або зелена бульбашка, при наведенні на яку ви побачите код відповіді (у більшості випадків очікується зелена бульбашка з кодом 200).",
					"wget": "Щоб переконатися, що homarr може спілкуватися з іншими програмами, виконайте wget/curl/ping IP:порт програми.",
					"iframe": "Що стосується iframe, то вони завжди повинні використовувати той самий протокол (http/s), що і Homarr.",
					"clearCache": "Деякі дані зберігаються в кеші, тому інтеграція може не спрацювати, якщо ви не очистите кеш у загальних налаштуваннях Homarr."
				},
				"footer": "Щоб дізнатися більше про усунення несправностей, зверніться на наш сайт {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Зовнішня адреса",
			"description": "URL-адреса відкриється в браузері при натисканні на додаток.",
			"tooltip": "Ви можете використовувати декілька змінних для створення динамічних адрес:<br><br><b>[homarr_base]</b>: повна адреса, за винятком порту і шляху. <i>(Приклад: 'https://subdomain.homarr.dev')</i><br><b>[homarr_hostname]</b>: повна базова адреса, включаючи поточний субдомен. <i>(Приклад: 'subdomain.homarr.dev')</i><br><b>[homarr_domain]</b>: домен з відфільтрованим субдоменом. <i>(Приклад: `homarr.dev')</i><br><b>[homarr_protocol]</b>: <i>http/https</i><br><br>Всі ці змінні залежать від поточного url."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Відкрити в новій вкладці",
			"description": "Відкрийте додаток у новій вкладці замість поточної."
		},
		"tooltipDescription": {
			"label": "Опис програми",
			"description": "Текст, який ви введете, з'явиться при наведенні на ваш додаток.\r\nВикористовуйте його, щоб надати користувачам більше інформації про ваш додаток або залишити порожнім, щоб нічого не було."
		},
		"customProtocolWarning": "Використання нестандартного протоколу. Це може вимагати попередньо встановлених додатків і створювати ризики для безпеки. Переконайтеся, що ваша адреса є безпечною та надійною."
	},
	"network": {
		"statusChecker": {
			"label": "Перевірка стану",
			"description": "Перевіряє, чи є ваш додаток в мережі за допомогою простого HTTP(S) запиту."
		},
		"statusCodes": {
			"label": "Код Статусу HTTP",
			"description": "HTTP коди, які розглядаються як онлайн."
		}
	},
	"appearance": {
		"icon": {
			"label": "Іконка програми",
			"description": "Почніть вводити текст щоб знайти значок. Також можна вставити адресу зображення для використання користувацької іконки.",
			"autocomplete": {
				"title": "Результатів не знайдено",
				"text": "Спробуйте використати більш конкретний пошуковий термін. Якщо ви не можете знайти потрібну піктограму, вставте URL-адресу зображення вище для створення власної піктограми"
			},
			"noItems": {
				"title": "Завантаження зовнішніх іконок",
				"text": "Це може зайняти кілька секунд"
			}
		},
		"appNameFontSize": {
			"label": "Назва програми Розмір шрифту",
			"description": "Встановіть розмір шрифту для відображення назви програми на плитці."
		},
		"appNameStatus": {
			"label": "Назва програми Статус",
			"description": "Виберіть, де ви хочете, щоб заголовок відображався, якщо він взагалі буде відображатися.",
			"dropdown": {
				"normal": "Показувати назву тільки на плитці",
				"hover": "Показувати назву лише при наведенні підказки",
				"hidden": "Не з'являтися взагалі"
			}
		},
		"positionAppName": {
			"label": "Назва програми Посада",
			"description": "Позиція назви програми відносно іконки.",
			"dropdown": {
				"top": "Верхня частина",
				"right": "Так.",
				"bottom": "Дно.",
				"left": "Ліворуч."
			}
		},
		"lineClampAppName": {
			"label": "Назва програми Затискач лінії",
			"description": "Визначає, на скількох рядках повинен максимально вміститися ваш заголовок. Встановіть 0 для необмеженого."
		}
	},
	"integration": {
		"type": {
			"label": "Налаштування інтеграції",
			"description": "Налаштування інтеграції, що буде використовуватися для підключення до вашої програми.",
			"placeholder": "Виберіть інтеграцію",
			"defined": "Визначено",
			"undefined": "Невизначено",
			"public": "Публічний",
			"private": "Приватний",
			"explanationPrivate": "Приватний секрет буде надіслано на сервер. Після оновлення сторінки він ніколи не буде відправлений клієнту.",
			"explanationPublic": "Публічний секрет завжди надсилається клієнту та є доступним через API. Він не повинен містити ніяких конфіденційних значень, таких як імена користувачів, паролі, токени, сертифікати та тому подібне!"
		},
		"secrets": {
			"description": "Щоб оновити секрет, введіть значення і натисніть кнопку Зберегти. Щоб видалити секрет, використовуйте кнопку \"Очистити\".",
			"warning": "Ваші облікові дані діють як доступ до ваших інтеграцій, а ви <strong>ніколи не повинні</strong> ділитися ними з кимось іншим. Офіційна команда Homarr ніколи не запитуватиме облікові дані. Переконайтеся, що <strong>безпечно зберігаєте і керуєте своїми секретами</strong>.",
			"clear": "Очистити секрет",
			"save": "Зберегти секрет",
			"update": "Оновити секрет"
		}
	},
	"validation": {
		"popover": "Ваша форма містить неприпустимі дані тож не може бути збережена. Будь ласка, розв'яжіть усі проблеми та натисніть цю кнопку знову, щоб зберегти свої зміни",
		"name": "Ім'я обов'язкове",
		"noUrl": "Урл обов'язковий",
		"invalidUrl": "Значення не є правильним URL-адресою",
		"noIconUrl": "Це поле обов'язкове для заповнення",
		"noExternalUri": "Потрібен зовнішній URI",
		"invalidExternalUri": "Зовнішній URI не є дійсним"
	}
}
