{
	"tabs": {
		"general": "Загальне",
		"behaviour": "Поведінка",
		"network": "Мережа",
		"appearance": "Вигляд",
		"integration": "Інтеграція"
	},
	"general": {
		"appname": {
			"label": "Назва застосунку",
			"description": "Використовується для зображення програми на головній сторінці"
		},
		"internalAddress": {
			"label": "Внутрішня адреса",
			"description": "Внутрішній IP додатку"
		},
		"externalAddress": {
			"label": "Зовнішня адреса",
			"description": "URL-адреса відкриється в браузері при натисканні на додаток"
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Відкрити в новій вкладці",
			"description": "Відкрийте посилання в новій вкладці"
		}
	},
	"network": {
		"statusChecker": {
			"label": "Перевірка стану",
			"description": "Відправляє простий HTTP / HTTPS запит, щоб перевірити, чи є ваш додаток онлайн"
		},
		"statusCodes": {
			"label": "Код Статусу HTTP",
			"description": "Визначає, які коди відповіді дозволено для цієї програми для отримання статусу 'Онлайн'"
		}
	},
	"appearance": {
		"icon": {
			"label": "Іконка програми",
			"description": "Логотип вашого додатку, що буде показано на вашій інформаційній панелі. (Повинен містити посилання на саме зображення)"
		}
	},
	"integration": {
		"type": {
			"label": "Налаштування інтеграції",
			"description": "Розглядає цей додаток як обрану інтеграцію та надає вам налаштування для кожного додатка",
			"placeholder": "Виберіть інтеграцію",
			"defined": "Визначено",
			"undefined": "Невизначено",
			"public": "Публічний",
			"private": "Приватний",
			"explanationPublic": "Приватний секрет буде надіслано на сервер. Після оновлення сторінки він ніколи не буде відправлений клієнту.",
			"explanationPrivate": "Публічний секрет завжди надсилається клієнту та є доступним через API. Він не повинен містити ніяких конфіденційних значень, таких як імена користувачів, паролі, токени, сертифікати та тому подібне"
		},
		"secrets": {
			"description": "Щоб оновити секрет, введіть значення і натисніть кнопку Зберегти. Щоб видалити секрет, використовуйте кнопку \"Очистити\".",
			"warning": "Ваші облікові дані діють як доступ до ваших інтеграцій, а ви <strong>ніколи не повинні</strong> ділитися ними з кимось іншим. Офіційна команда Homarr ніколи не запитуватиме облікові дані. Переконайтеся, що <strong>безпечно зберігаєте і керуєте своїми секретами</strong>.",
			"clear": "Очистити секрет",
			"save": "Зберегти секрет",
			"update": "Оновити секрет"
		}
	},
	"validation": {
		"popover": "Ваша форма містить неприпустимі дані тож не може бути збережена. Будь ласка, розв'яжіть усі проблеми та натисніть цю кнопку знову, щоб зберегти свої зміни"
	}
}