{
	"tabs": {
		"general": "Allmänt",
		"behaviour": "Beteende",
		"network": "Nätverk",
		"appearance": "Utseende",
		"integration": "Integration"
	},
	"general": {
		"appname": {
			"label": "Appnamn",
			"description": "Används för att visa appen på instrumentpanelen."
		},
		"internalAddress": {
			"label": "Intern adress",
			"description": "Appens interna IP-adress."
		},
		"externalAddress": {
			"label": "Extern adress",
			"description": "URL som öppnas när du klickar på appen."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Öppna i ny flik",
			"description": "Öppna appen i en ny flik istället för den nuvarande."
		},
		"customProtocolWarning": "Använda ett protokoll som inte är standard. Detta kan kräva förinstallerade applikationer och kan medföra säkerhetsrisker. Se till att din adress är säker och betrodd."
	},
	"network": {
		"statusChecker": {
			"label": "Statuskontroll",
			"description": "Kontrollerar om din app är online med en enkel HTTP(S) begäran."
		},
		"statusCodes": {
			"label": "HTTP-statuskoder",
			"description": "HTTP-statuskoder som anses vara online."
		}
	},
	"appearance": {
		"icon": {
			"label": "Appikon",
			"description": "Börja skriva för att hitta en ikon. Du kan också klistra in en bild-URL för att använda en anpassad ikon.",
			"autocomplete": {
				"title": "Hittade inga resultat",
				"text": "Försök att använda en mer specifik sökterm. Om du inte kan hitta önskad ikon, klistra in bild-URL ovan för en anpassad ikon"
			},
			"noItems": {
				"title": "Laddar externa ikoner",
				"text": "Detta kan ta några sekunder"
			}
		}
	},
	"integration": {
		"type": {
			"label": "Integrationskonfiguration",
			"description": "Integrationskonfigurationen som kommer att användas för att ansluta till din app.",
			"placeholder": "Välj en integration",
			"defined": "Definierad",
			"undefined": "Odefinierad",
			"public": "Publik",
			"private": "Privat",
			"explanationPrivate": "En privat hemlighet skickas endast en gång till servern. När webbläsaren har uppdaterat sidan kommer den aldrig skickas igen.",
			"explanationPublic": "En offentlig hemlighet kommer alltid att skickas till klienten och är tillgänglig över API. Det bör inte innehålla några konfidentiella värden som användarnamn, lösenord, tokens, certifikat och liknande!"
		},
		"secrets": {
			"description": "För att uppdatera en hemlighet, ange ett värde och klicka på knappen Spara. För att ta bort en hemlighet, använd knappen rensa.",
			"warning": "Dina autentiseringsuppgifter fungerar som åtkomst till dina integrationer och du bör <strong>aldrig</strong> dela dem med någon annan. Homarr-teamet kommer aldrig att be om autentiseringsuppgifter. Se till att <strong>lagra och hantera dina hemligheter på ett säkert sätt</strong>.",
			"clear": "Rensa hemlighet",
			"save": "Spara hemlighet",
			"update": "Uppdatera hemlighet"
		}
	},
	"validation": {
		"popover": "Ditt formulär innehåller ogiltiga data. Därför kan det inte sparas. Vänligen lös alla problem och klicka på denna knapp igen för att spara dina ändringar"
	}
}
