{
	"tabs": {
		"general": "Allmänt",
		"behaviour": "Beteende",
		"network": "Nätverk",
		"appearance": "Utseende",
		"integration": "Integration"
	},
	"general": {
		"appname": {
			"label": "Appnamn",
			"description": "Används för att visa appen på instrumentpanelen."
		},
		"internalAddress": {
			"label": "Intern adress",
			"description": "Appens interna IP-adress.",
			"troubleshoot": {
				"label": "Har du problem?",
				"header": "Här är en lista på vanliga misstag och felsökning:",
				"lines": {
					"nothingAfterPort": "Du bör i de flesta fall, om inte alla, inte ange någon sökväg efter porten. (Även '/admin' för pihole eller '/web' för plex)",
					"protocolCheck": "Kontrollera alltid att webbadressen föregås av http eller https, och att du använder rätt URL.",
					"preferIP": "Vi rekommenderar att du använder det direkta ip-numret för den maskin eller container du försöker kommunicera med.",
					"enablePings": "Kontrollera att IP är rätt genom att aktivera pings. Anpassa tavla -> Layout -> Aktivera pings. En liten röd eller grön bubbla kommer att visas på din app och om du håller muspekaren över den får du svarskoden (en grön bubbla med kod 200 förväntas i de flesta fall).",
					"wget": "För att se till att homarr kan kommunicera med de andra apparna, se till att wget/curl/ping appens IP:port.",
					"iframe": "När det gäller iframes ska dessa alltid använda samma protokoll (http/s) som Homarr.",
					"clearCache": "Viss information registreras i cacheminnet, så en integration kanske inte fungerar om du inte rensar cacheminnet i Homarrs allmänna alternativ."
				},
				"footer": "För mer felsökning, kontakta oss på vår {{discord}}."
			}
		},
		"externalAddress": {
			"label": "Extern adress",
			"description": "URL som öppnas när du klickar på appen.",
			"tooltip": "Du kan använda några variabler för att skapa dynamiska adresser:<br><br><b>[homarr_base]</b>: fullständig adress exklusive port och sökväg. <i>(Exempel: 'https://subdomain.homarr.dev')</i><br><b>[homarr_hostname]</b>: fullständig basadress inklusive dess aktuella underdomän. <i>(Exempel: 'subdomain.homarr.dev')</i><br><b>[homarr_domain]</b>: domän med underdomän bortfiltrerad. <i>(Exempel: `homarr.dev')</i><br><b>[homarr_protocol]</b>: <i>http/https</i><br><br>Dessa variabler är alla beroende av den aktuella webbadressen."
		}
	},
	"behaviour": {
		"isOpeningNewTab": {
			"label": "Öppna i ny flik",
			"description": "Öppna appen i en ny flik istället för den nuvarande."
		},
		"tooltipDescription": {
			"label": "Applikationsbeskrivning",
			"description": "Den text du anger kommer att visas när du håller muspekaren över din app.\nAnvänd detta för att ge användarna mer information om din app eller lämna tomt för att inte ha något."
		},
		"customProtocolWarning": "Använda ett protokoll som inte är standard. Detta kan kräva förinstallerade applikationer och kan medföra säkerhetsrisker. Se till att din adress är säker och betrodd."
	},
	"network": {
		"statusChecker": {
			"label": "Statuskontroll",
			"description": "Kontrollerar om din app är online med en enkel HTTP(S) begäran."
		},
		"statusCodes": {
			"label": "HTTP-statuskoder",
			"description": "HTTP-statuskoder som anses vara online."
		}
	},
	"appearance": {
		"icon": {
			"label": "Appikon",
			"description": "Börja skriva för att hitta en ikon. Du kan också klistra in en bild-URL för att använda en anpassad ikon.",
			"autocomplete": {
				"title": "Hittade inga resultat",
				"text": "Försök att använda en mer specifik sökterm. Om du inte kan hitta önskad ikon, klistra in bild-URL ovan för en anpassad ikon"
			},
			"noItems": {
				"title": "Laddar externa ikoner",
				"text": "Detta kan ta några sekunder"
			}
		},
		"appNameFontSize": {
			"label": "Teckenstorlek för appnamn",
			"description": "Ange teckenstorlek för när appens namn visas på rutan."
		},
		"appNameStatus": {
			"label": "Status för appens namn",
			"description": "Välj var du vill att titeln ska visas, om överhuvudtaget.",
			"dropdown": {
				"normal": "Visa endast rubrik på ruta",
				"hover": "Visa rubrik endast vid hovring av verktygstips",
				"hidden": "Visa inte överhuvudtaget"
			}
		},
		"positionAppName": {
			"label": "Appens namnposition",
			"description": "Position för appens namn i förhållande till ikonen.",
			"dropdown": {
				"top": "Topp",
				"right": "Höger",
				"bottom": "Botten",
				"left": "Vänster"
			}
		},
		"lineClampAppName": {
			"label": "Radbrytning för appnamn",
			"description": "Definierar hur många rader din titel maximalt ska rymmas på. Ange 0 för obegränsat."
		}
	},
	"integration": {
		"type": {
			"label": "Integrationskonfiguration",
			"description": "Integrationskonfigurationen som kommer att användas för att ansluta till din app.",
			"placeholder": "Välj en integration",
			"defined": "Definierad",
			"undefined": "Odefinierad",
			"public": "Publik",
			"private": "Privat",
			"explanationPrivate": "En privat hemlighet skickas endast en gång till servern. När webbläsaren har uppdaterat sidan kommer den aldrig skickas igen.",
			"explanationPublic": "En offentlig hemlighet kommer alltid att skickas till klienten och är tillgänglig över API. Det bör inte innehålla några konfidentiella värden som användarnamn, lösenord, tokens, certifikat och liknande!"
		},
		"secrets": {
			"description": "För att uppdatera en hemlighet, ange ett värde och klicka på knappen Spara. För att ta bort en hemlighet, använd knappen rensa.",
			"warning": "Dina autentiseringsuppgifter fungerar som åtkomst till dina integrationer och du bör <strong>aldrig</strong> dela dem med någon annan. Homarr-teamet kommer aldrig att be om autentiseringsuppgifter. Se till att <strong>lagra och hantera dina hemligheter på ett säkert sätt</strong>.",
			"clear": "Rensa hemlighet",
			"save": "Spara hemlighet",
			"update": "Uppdatera hemlighet"
		}
	},
	"validation": {
		"popover": "Ditt formulär innehåller ogiltiga data. Därför kan det inte sparas. Vänligen lös alla problem och klicka på denna knapp igen för att spara dina ändringar",
		"name": "Namn krävs",
		"noUrl": "URL krävs",
		"invalidUrl": "Värdet är inte en giltig URL",
		"noIconUrl": "Detta fält är obligatoriskt",
		"noExternalUri": "Extern URI krävs",
		"invalidExternalUri": "Extern URI är inte en giltig uri"
	}
}
